IBST_Lectures.org
#+TITLE: Информационная безопасность систем и технологий
#+AUTHOR: Максим Захаров
#+STARTUP: indent

* Протокол IP
  CLOCK: [2010-09-08 Срд 10:03]--[2010-09-08 Срд 11:23] =>  1:20
Протокол сетевого уровня, обеспечивает передачу дейтаграмм между компьютерами, разбиение их на фрагменты и её маршрутизацию.

Протокол IP не гарантирует надёжную доставку дейтаграмм, он не управляет потоком данных и не выявляет ошибки передачи. Оптимизация маршрута проводится только для соседних узлов.

Максимальный размер пакета равен 2^16 байт.

Связь по протоколу поддерживается без установления соединения.

Протокол IP использует 32-разрядные адреса компьютера в версии 4. В версии 6 используются 128-разрядные адреса.

