html/IBST_Lectures.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Информационная безопасность систем и технологий</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-04 11:57:01 MSK"/>
<meta name="author" content="Максим Захаров"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Информационная безопасность систем и технологий</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Протокол IP </a>
<ul>
<li><a href="#sec-1_1">1.1 Заголовок протокола IP </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Протокол ICMP (Internet control message protocol) </a></li>
<li><a href="#sec-3">3 Протокол IP версии 6 </a>
<ul>
<li><a href="#sec-3_1">3.1 Заголовки расширений IP </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Протокол IPsec </a>
<ul>
<li><a href="#sec-4_1">4.1 Защищённая связь </a></li>
<li><a href="#sec-4_2">4.2 Формат пакетов ESP </a></li>
<li><a href="#sec-4_3">4.3 Управление ключами </a></li>
<li><a href="#sec-4_4">4.4 Протокол ISAKMP </a></li>
<li><a href="#sec-4_5">4.5 Тип обмена </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Протоколы транспортного уровня </a>
<ul>
<li><a href="#sec-5_1">5.1 TCP </a>
<ul>
<li><a href="#sec-5_1_1">5.1.1 Передача сообщения </a></li>
</ul>
</li>
<li><a href="#sec-5_2">5.2 UDP </a></li>
</ul>
</li>
<li><a href="#sec-6">6 Дополнительная лекция </a>
<ul>
<li><a href="#sec-6_1">6.1 IP адресация </a></li>
<li><a href="#sec-6_2">6.2 Классовая модель адресов </a></li>
<li><a href="#sec-6_3">6.3 Специальные IP адреса </a></li>
<li><a href="#sec-6_4">6.4 Серые адреса </a></li>
<li><a href="#sec-6_5">6.5 Бесклассовая модель </a></li>
<li><a href="#sec-6_6">6.6 Практика </a></li>
<li><a href="#sec-6_7">6.7 Маршрутизация </a></li>
</ul>
</li>
<li><a href="#sec-7">7 Протокол SSL </a>
<ul>
<li><a href="#sec-7_1">7.1 Работа протокола SSL </a></li>
<li><a href="#sec-7_2">7.2 Уязвимости SSL </a></li>
</ul>
</li>
<li><a href="#sec-8">8 Протокол Kerberos </a>
<ul>
<li><a href="#sec-8_1">8.1 Описание протокола </a></li>
</ul>
</li>
<li><a href="#sec-9">9 Межсетевые экраны </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Протокол IP </h2>
<div class="outline-text-2" id="text-1">

<p>Протокол сетевого уровня, обеспечивает передачу дейтаграмм между компьютерами, разбиение их на фрагменты и её маршрутизацию.
</p>
<p>
Протокол IP не гарантирует надёжную доставку дейтаграмм, он не управляет потоком данных и не выявляет ошибки передачи. Оптимизация маршрута проводится только для соседних узлов.
</p>
<p>
Максимальный размер пакета равен 2<sup>16</sup> байт.
</p>
<p>
Связь по протоколу поддерживается без установления соединения.
</p>
<p>
Протокол IP использует 32-разрядные адреса компьютера в версии 4. В версии 6 используются 128-разрядные адреса.
</p>

</div>
