other/IBST_Lectures.tex
% Created 2011-01-06 Чт. 12:50
\documentclass[12pt, russian, oneside, article]{ncc}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[math]{pscyr}
\usepackage{indentfirst}
\providecommand{\alert}[1]{\textbf{#1}}
\begin{document}



\title{Информационная безопасность систем и технологий}
\author{Максим Захаров}
\date{06 Январь 2011}
\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}


\href{file:///home/maxim/Documents/Git/lectures/index.org}{На главную} | \href{file:///home/maxim/Documents/Git/lectures/other/IBST_Lectures.pdf}{Скачать в PDF}

\section{Протокол IP}
\label{sec-1}

Протокол сетевого уровня, обеспечивает передачу дейтаграмм между компьютерами, разбиение их на фрагменты и её маршрутизацию.

Протокол IP не гарантирует надёжную доставку дейтаграмм, он не управляет потоком данных и не выявляет ошибки передачи. Оптимизация маршрута проводится только для соседних узлов.

Максимальный размер пакета равен 2$^{\mathrm{16}}$ байт.

Связь по протоколу поддерживается без установления соединения.

Протокол IP использует 32-разрядные адреса компьютера в версии 4. В версии 6 используются 128-разрядные адреса.
