html/IBST_Lectures.html

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> Заголовок протокола IP </h3>
<div class="outline-text-3" id="text-1_1">

<p>Длина заголовка равна 5 или 6 32-разрядных слов.
</p>
<p>
Поля:
</p>
<ol>
<li>
<i>Версия</i>. В нём содержится версия протокола IP. Это поле указывает программе-получателю как декодировать все остальные поля заголовка, т. к в разных версиях поля отличаются. Если программа не работает с указанной версией протокола, то дейтаграмма отбрасывается.

</li>
<li>
<i>Длина заголовка</i>. В нём хранится длина заголовка. Размер поля 4 бита. В нём написано либо число 5, либо 6.

</li>
<li>
<i>Тип обслуживания</i>. Длина 8 бит. Первые 3 бита обозначают приоритет дейтаграммы. Если он равен 0 &mdash; обычная, все 1 &mdash; сетевое управление. 1 бит &mdash; задержка, следующий &mdash; пропускная способность, далее &mdash; надёжность.

</li>
<li>
<i>Длина дейтаграммы</i>. Длина поля 16 бит.

</li>
<li>
<i>Идентификатор</i>. Длина 16 бит. В нём содержится уникальный идентификатор, присвоенный дейтаграмме передающим узлом. Идентификатор получают от протоколов вышестоящего уровня. Он используется для правильной сборки сообщений при фрагментации.

</li>
<li>
<i>Флаги</i>. 3 бита. 1 бит не используется, 2 бит &mdash; флаг не фрагментировать, 3 бит &mdash; есть ещё фрагменты.

</li>
<li>
<i>Смещение фрагмента</i>. Номер фрагмента в сообщении. Его длина 13 бит. Смещение указывается в единицах, кратных 8 байтам.

</li>
<li>
<i>Время жизни</i>. Длина 8 бит. Время в секундах, которое отводится на доставку дейтаграммы. Обычно 15-30 секунд. Если время жизни истекло, дейтаграмма уничтожается. Каждый узел, в который попадает дейтаграмма, уменьшает время жизни на 1 или больше.

</li>
<li>
<i>Протокол</i>. Длина 8 бит. В нём содержится код протокола транспортного уровня, для которого предназначена дейтаграмма. Для TCP &mdash; 6.

</li>
<li>
<i>Контрольная сумма заголовка</i>. Длина 16 бит. Контрольная сумма вычисляется по всему заголовку и меняется в каждом узле, через которую она проходит. Она вычисляется путём сложения всех 16-разрядных слов заголовка и дополнением результата 1.

</li>
<li>
<i>IP-адрес отправителя</i>. 32 бита.

</li>
<li>
<i>IP-адрес получателя</i>. 32 бита.

</li>
<li>
<i>Опции</i>. Каждой опции отводится 1 байт. Каждый байт делится на 3 части.
<ul>
<li>
1 часть &mdash; копия, занимает 1 бит (нужно ли копировать поле "опции" при фрагментации дейтаграмм).
</li>
<li>
2 часть &mdash; класс опции, занимает 2 бита (класс 00 &mdash; управление сетью, класс 10 &mdash; отладка сети).
</li>
<li>
3 часть &mdash; номер опции, 5 бит (00000 &mdash; конец списка опций, 00011 &mdash; совместная маршрутизация, где часть маршрута задаётся отправителем, остальные определяются шлюзами, 01001 &mdash; маршрутизация отправителя, где все узлы задаются отправителем, 00111 &mdash; обозначает запись маршрута, 00100 &mdash; запись временных меток).

</li>
</ul>
</li>
<li>
<i>Заполнитель</i>. Для дополнения заголовка до целого числа 32-разрядных слов. 
</li>
</ol>


<p>
После формирования дейтаграммы конструируются заголовок. Для него вычисляется контрольная сумма. Определяется узел, в которую предполагается отправить дейтаграмму. Если получатель находится в той же сети, что и отравитель, этим следующим узлом будет получатель. Если нет, то следующим узлом будет шлюз. Если используется опция "запись маршрута", то добавляются адреса узлов нужного маршрута. Дейтаграмма передаётся через протоколы нижележащих уровней в сеть.
</p>
<p>
Каждый шлюз в сети, через который проходит дейтаграмма проверяет контрольную сумму. Если контрольные суммы не совпадают, дейтаграмма уничтожается, а отправителю передаётся сообщение об ошибке. Если совпадают, уменьшается значение поля "время жизни", если это поле равно 0, то дейтаграмма уничтожается.
</p>
<p>
Определяется следующий узел маршрута, исходя из адреса получателя или опции маршрутизации. Заголовок перестраивается заново. Если при этом требуется фрагментация и соответствующий флаг не фрагментируется, дейтаграмма уничтожается и отправителю отправляется сообщение об ошибке.
</p>
<p>
При необходимости может быть записана временная метка. После того, как дейтаграмма достигла машины получателя, проверяется контрольная сумма заголовка. Получатель ждёт сборки в течение определённого времени. Если за это время сообщение не было собрано, то все его полученные фрагменты уничтожаются, отправителю отправляется сообщение об ошибке. Если всё нормально, IP заголовков уничтожаются, сообщение передаётся на более высокий уровень, если требуется, отправителю посылается ответ.
</p>
</div>
</div>

</div>
