IBST_Lectures.org
* Протокол ICMP (Internet control message protocol)
  CLOCK: [2010-09-22 Срд 10:04]--[2010-09-22 Срд 11:25] =>  1:21
Этот протокол сообщает отправителю об ошибках в сети. Используется совместно с IP. ICMP-дейтаграмма снабжена IP-заголовком, поэтому она в сети обрабатывается также, как обычная IP-дейтаграмма. В узлах сети ICMP-дейтаграммы обрабатываются на сетевом уровне.

Сообщения об ошибках передаются машине отправителя, а внутри ICMP-сообщение. Внутри этого ICMP-сообщения находятся IP-заголовок и первые 64 бита дейтаграммы, при передаче которой возникла ошибка.

Вид заголовка хранится в ICMP-заголовке. Заголовок состоит из 3 полей:
1) Тип сообщения.
   - 0 --- эхо-ответ;
   - 8 --- эхо-запрос;
   - 3 --- адресат недостижим. Это же сообщение генерируется, если шлюзу необходимо фрагментировать дейтаграмму, а в ней установлен флаг "не фрагментировать";
   - 4 --- снизить скорость передачи данных;
   - 5 --- переадресовать. Служебное сообщение для шлюзов при выполнении маршрутизации;
   - 11 --- время жизни дейтаграммы истекло;
   - 12 --- неправильный параметр. Возникает при обнаружении семантической или синтаксической ошибки в IP-заголовке;
   - 13 --- запрос временной метки;
   - 14 --- отклик на запрос временной метки. Они нужны для контроля прохождения дейтаграмм через узлы сети. При этом внутри ICMP-сообщения в запросе записывается вместо IP-заголовка исходная временная метка, а в отклике к этой метке добавляется метка получения запроса шлюза и метка отправки ответа шлюзу;
   - 17 --- запрос адресной маски;
   - 18 --- отклик на запрос адресной маски. Эти сообщения применяются для тестирования определённой подсети с заданной маски.
2) Код сообщения.
3) Контрольная сумма ICMP-заголовка. Вычисляется также, как контрольная сумма IP-заголовка.

* Протокол IP версии 6

Основное отличие от версии 4 заключается в использовании 128-битных IP-адресов. Кроме этого протокол предусматривает введение метки для контроля качества обслуживания и предотвращения фрагментации в промежуточных узлах. В этом протоколе предусматривается встроенное средство для аутентификации и шифрования данных.

Заголовок имеет длину 40 байт.
1) /Версия/. 4 бита.
2) /Приоритет/. Приоритет дейтаграммы. 4 бита.
3) /Метка потока/. Длина 24  бита. При помощи этого поля помечаются дейтаграммы, для которых в маршрутизаторах сети требуется специальная обработка.
4) /Длина всей IP-дейтаграммы минус длина заголовка/. 16 бит.
5) /Следующий заголовок/. Его длина 8 бит. В нём определяется заголовок, который находится за заголовком IP. Следующим заголовком может быть заголовок транспортного уровня либо заголовок расширения IP.
6) /Предельное число транзитов/. Длина 8 бит.
7) /Адрес источника/. 128 бит.
8) /Адрес получателя/. 128 бит.

** Заголовки расширений IP

1) Заголовок параметров транзита. В нём содержится дополнительная информация для маршрутизаторов. Используется в настоящее время для передачи пакетов длиной до 4 ГБ.
2) Заголовок параметров адресата. В нём содержится информация, которую будет обрабатывать конечный получатель пакета.
3) Заголовок маршрутизации. Используется для маршрутизации. В нём содержится список узлов, через которые должна пройти IP-дейтаграмма. Он начинается: сначала указывается поле следующего заголовка, затем указывается длина заголовка маршрутизации, потом указывается тип маршрутизации, потом оставшиеся сегменты, т. е. оставшиеся узлы, через которые должна пройти дейтаграмма. После этого указывается сам маршрут.
4) Заголовок фрагментации. Используется при необходимости фрагментации дейтаграмм. Фрагментация может быть выполнена только отправителем. Заголовок состоит:
   - следующий заголовок;
   - смещение фрагмента. Длина 13 бит. Смещение измеряется в единицах, кратных 64 битам;
   - 2 бита не используются;
   - флаг "есть ещё фрагменты";
   - идентификатор дейтаграммы. Длина 32 бита.
5) Заголовок аутентификации.
6) Заголовок шифрования.

