html/IBST_Lectures.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Протокол ICMP (Internet control message protocol) </h2>
<div class="outline-text-2" id="text-2">

<p>Этот протокол сообщает отправителю об ошибках в сети. Используется совместно с IP. ICMP-дейтаграмма снабжена IP-заголовком, поэтому она в сети обрабатывается также, как обычная IP-дейтаграмма. В узлах сети ICMP-дейтаграммы обрабатываются на сетевом уровне.
</p>
<p>
Сообщения об ошибках передаются машине отправителя, а внутри ICMP-сообщение. Внутри этого ICMP-сообщения находятся IP-заголовок и первые 64 бита дейтаграммы, при передаче которой возникла ошибка.
</p>
<p>
Вид заголовка хранится в ICMP-заголовке. Заголовок состоит из 3 полей:
</p><ol>
<li>
Тип сообщения.
<ul>
<li>
0 &mdash; эхо-ответ;
</li>
<li>
8 &mdash; эхо-запрос;
</li>
<li>
3 &mdash; адресат недостижим. Это же сообщение генерируется, если шлюзу необходимо фрагментировать дейтаграмму, а в ней установлен флаг "не фрагментировать";
</li>
<li>
4 &mdash; снизить скорость передачи данных;
</li>
<li>
5 &mdash; переадресовать. Служебное сообщение для шлюзов при выполнении маршрутизации;
</li>
<li>
11 &mdash; время жизни дейтаграммы истекло;
</li>
<li>
12 &mdash; неправильный параметр. Возникает при обнаружении семантической или синтаксической ошибки в IP-заголовке;
</li>
<li>
13 &mdash; запрос временной метки;
</li>
<li>
14 &mdash; отклик на запрос временной метки. Они нужны для контроля прохождения дейтаграмм через узлы сети. При этом внутри ICMP-сообщения в запросе записывается вместо IP-заголовка исходная временная метка, а в отклике к этой метке добавляется метка получения запроса шлюза и метка отправки ответа шлюзу;
</li>
<li>
17 &mdash; запрос адресной маски;
</li>
<li>
18 &mdash; отклик на запрос адресной маски. Эти сообщения применяются для тестирования определённой подсети с заданной маски.
</li>
</ul>
</li>
<li>
Код сообщения.
</li>
<li>
Контрольная сумма ICMP-заголовка. Вычисляется также, как контрольная сумма IP-заголовка.
</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Протокол IP версии 6 </h2>
<div class="outline-text-2" id="text-3">


<p>
Основное отличие от версии 4 заключается в использовании 128-битных IP-адресов. Кроме этого протокол предусматривает введение метки для контроля качества обслуживания и предотвращения фрагментации в промежуточных узлах. В этом протоколе предусматривается встроенное средство для аутентификации и шифрования данных.
</p>
<p>
Заголовок имеет длину 40 байт.
</p><ol>
<li>
<i>Версия</i>. 4 бита.
</li>
<li>
<i>Приоритет</i>. Приоритет дейтаграммы. 4 бита.
</li>
<li>
<i>Метка потока</i>. Длина 24  бита. При помощи этого поля помечаются дейтаграммы, для которых в маршрутизаторах сети требуется специальная обработка.
</li>
<li>
<i>Длина всей IP-дейтаграммы минус длина заголовка</i>. 16 бит.
</li>
<li>
<i>Следующий заголовок</i>. Его длина 8 бит. В нём определяется заголовок, который находится за заголовком IP. Следующим заголовком может быть заголовок транспортного уровня либо заголовок расширения IP.
</li>
<li>
<i>Предельное число транзитов</i>. Длина 8 бит.
</li>
<li>
<i>Адрес источника</i>. 128 бит.
</li>
<li>
<i>Адрес получателя</i>. 128 бит.
</li>
</ol>



</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Заголовки расширений IP </h3>
<div class="outline-text-3" id="text-3_1">


<ol>
<li>
Заголовок параметров транзита. В нём содержится дополнительная информация для маршрутизаторов. Используется в настоящее время для передачи пакетов длиной до 4 ГБ.
</li>
<li>
Заголовок параметров адресата. В нём содержится информация, которую будет обрабатывать конечный получатель пакета.
</li>
<li>
Заголовок маршрутизации. Используется для маршрутизации. В нём содержится список узлов, через которые должна пройти IP-дейтаграмма. Он начинается: сначала указывается поле следующего заголовка, затем указывается длина заголовка маршрутизации, потом указывается тип маршрутизации, потом оставшиеся сегменты, т. е. оставшиеся узлы, через которые должна пройти дейтаграмма. После этого указывается сам маршрут.
</li>
<li>
Заголовок фрагментации. Используется при необходимости фрагментации дейтаграмм. Фрагментация может быть выполнена только отправителем. Заголовок состоит:
<ul>
<li>
следующий заголовок;
</li>
<li>
смещение фрагмента. Длина 13 бит. Смещение измеряется в единицах, кратных 64 битам;
</li>
<li>
2 бита не используются;
</li>
<li>
флаг "есть ещё фрагменты";
</li>
<li>
идентификатор дейтаграммы. Длина 32 бита.
</li>
</ul>
</li>
<li>
Заголовок аутентификации.
</li>
<li>
Заголовок шифрования.
</li>
</ol>


</div>
</div>

</div>
