other/IBST_Lectures.tex
\section{Протокол ICMP (Internet control message protocol)}
\label{sec-2}

Этот протокол сообщает отправителю об ошибках в сети. Используется совместно с IP. ICMP-дейтаграмма снабжена IP-заголовком, поэтому она в сети обрабатывается также, как обычная IP-дейтаграмма. В узлах сети ICMP-дейтаграммы обрабатываются на сетевом уровне.

Сообщения об ошибках передаются машине отправителя, а внутри ICMP-сообщение. Внутри этого ICMP-сообщения находятся IP-заголовок и первые 64 бита дейтаграммы, при передаче которой возникла ошибка.

Вид заголовка хранится в ICMP-заголовке. Заголовок состоит из 3 полей:
\begin{enumerate}
\item Тип сообщения.

\begin{itemize}
\item 0 --- эхо-ответ;
\item 8 --- эхо-запрос;
\item 3 --- адресат недостижим. Это же сообщение генерируется, если шлюзу необходимо фрагментировать дейтаграмму, а в ней установлен флаг ``не фрагментировать'';
\item 4 --- снизить скорость передачи данных;
\item 5 --- переадресовать. Служебное сообщение для шлюзов при выполнении маршрутизации;
\item 11 --- время жизни дейтаграммы истекло;
\item 12 --- неправильный параметр. Возникает при обнаружении семантической или синтаксической ошибки в IP-заголовке;
\item 13 --- запрос временной метки;
\item 14 --- отклик на запрос временной метки. Они нужны для контроля прохождения дейтаграмм через узлы сети. При этом внутри ICMP-сообщения в запросе записывается вместо IP-заголовка исходная временная метка, а в отклике к этой метке добавляется метка получения запроса шлюза и метка отправки ответа шлюзу;
\item 17 --- запрос адресной маски;
\item 18 --- отклик на запрос адресной маски. Эти сообщения применяются для тестирования определённой подсети с заданной маски.
\end{itemize}

\item Код сообщения.
\item Контрольная сумма ICMP-заголовка. Вычисляется также, как контрольная сумма IP-заголовка.
\end{enumerate}
\section{Протокол IP версии 6}
\label{sec-3}


Основное отличие от версии 4 заключается в использовании 128-битных IP-адресов. Кроме этого протокол предусматривает введение метки для контроля качества обслуживания и предотвращения фрагментации в промежуточных узлах. В этом протоколе предусматривается встроенное средство для аутентификации и шифрования данных.

Заголовок имеет длину 40 байт.
\begin{enumerate}
\item \emph{Версия}. 4 бита.
\item \emph{Приоритет}. Приоритет дейтаграммы. 4 бита.
\item \emph{Метка потока}. Длина 24  бита. При помощи этого поля помечаются дейтаграммы, для которых в маршрутизаторах сети требуется специальная обработка.
\item \emph{Длина всей IP-дейтаграммы минус длина заголовка}. 16 бит.
\item \emph{Следующий заголовок}. Его длина 8 бит. В нём определяется заголовок, который находится за заголовком IP. Следующим заголовком может быть заголовок транспортного уровня либо заголовок расширения IP.
\item \emph{Предельное число транзитов}. Длина 8 бит.
\item \emph{Адрес источника}. 128 бит.
\item \emph{Адрес получателя}. 128 бит.
\end{enumerate}
\subsection{Заголовки расширений IP}
\label{sec-3_1}


\begin{enumerate}
\item Заголовок параметров транзита. В нём содержится дополнительная информация для маршрутизаторов. Используется в настоящее время для передачи пакетов длиной до 4 ГБ.
\item Заголовок параметров адресата. В нём содержится информация, которую будет обрабатывать конечный получатель пакета.
\item Заголовок маршрутизации. Используется для маршрутизации. В нём содержится список узлов, через которые должна пройти IP-дейтаграмма. Он начинается: сначала указывается поле следующего заголовка, затем указывается длина заголовка маршрутизации, потом указывается тип маршрутизации, потом оставшиеся сегменты, т. е. оставшиеся узлы, через которые должна пройти дейтаграмма. После этого указывается сам маршрут.
\item Заголовок фрагментации. Используется при необходимости фрагментации дейтаграмм. Фрагментация может быть выполнена только отправителем. Заголовок состоит:

\begin{itemize}
\item следующий заголовок;
\item смещение фрагмента. Длина 13 бит. Смещение измеряется в единицах, кратных 64 битам;
\item 2 бита не используются;
\item флаг ``есть ещё фрагменты'';
\item идентификатор дейтаграммы. Длина 32 бита.
\end{itemize}

\item Заголовок аутентификации.
\item Заголовок шифрования.
\end{enumerate}
