IBST_Lectures.org
* Протокол IPsec

Протокол IPsec обеспечивает защиту обмена данными в сетях за счёт шифрования и (или) аутентификации всего потока данных на уровне IP.

Протокол может работать в двух режимах:
1) Транспортный. В этом режиме защищаются только данные из IP-дейтаграмм, а заголовок IP-дейтаграммы не защищается.
2) Туннельный. В этом режиме защищается вся IP-дейтаграмма. Для этого к защищённой IP-дейтаграмме добавляется новый IP-заголовок, никак не защищённый. Обычно в нём указывается IP-адрес маршрутизатора или шлюза, который стоит в сети конечного получателя.

IPsec поддерживает два протокола защиты:
1) Аутентификация AH.
2) Протокол шифрования аутентификации ESP.

Внутри каждого из этих протоколов может использоваться несколько различных алгоритмов.

Дополнительно в протоколе IPsec определён протокол распределения ключей.

Заголовок аутентификации обеспечивает аутентификацию IP-дейтаграмм и проверку целостности данных в нём.

Заголовок состоит из следующих полей:
1) Следующий заголовок. Длина 8 бит.
2) Длина. Здесь длина заголовка в 32-битных единицах минус 2.
3) Зарезервированных 16 бит.
4) Индекс параметров защиты. Длина 32 бита. Он идентифицирует защищённую связь.
5) Порядковый номер. Длина 32 бита. Порядковый номер дейтаграммы, который был послан по данной защищённой связи.
6) Данные аутентификации. В нём содержится код аутентификации.

** Защищённая связь

Связь --- односторонние отношения между отправителем и получателем.

Связь определяется параметрами:
1) Индекс параметров защиты. Строка битов, которая обозначает некий условный номер этой связи. По нему определяются алгоритмы обработки принятого пакета.
2) IP-адрес получателя.
3) Идентификатор протокола защиты. Параметры защищённой связи хранятся в специальных таблицах. В этих таблицах записаны:
   - счётчик порядкового номера;
   - флаг переполнения счётчика порядкового номера;
   - окно защиты от воспроизведения. Для защиты от повторной передачи одних и тех же дейтаграмм.
4) Информация AH. Хранятся параметры для алгоритма аутентификации.
5) Информация ESP. В нём хранятся параметры выбранного алгоритма шифрования.
6) Время жизни защищённой связи. Это интервал времени или значение счётчика байтов, по достижении которого связь уничтожается.
7) Режим IPsec.
8) Максимальная единица передачи маршрута. Максимальный размер пакета, который может быть передан без фрагментации.

Защищённые связи связываются с потоком IP через селекторы. Эти селекторы хранятся в базе данных политики защиты. Деление потоков может осуществляться по IP адресам пункта назначения, IP адресам источников, по протоколу транспортного уровня, по метке потока протокола IPv6 и т. п.

** Формат пакетов ESP

1) Индекс параметров защиты. Длина 32 бита. Номер защищённой связи.
2) Порядковый номер дейтаграммы. Длина 32 бита.
3) Передаваемые данные.
4) Заполнитель. Нужен для правильной работы алгоритма шифрования.
5) Длина заполнителя.
6) Следующий заголовок. Длина 8 бит.
7) Данные аутентификации. Вычисляется для всей дейтаграммы ESP.

Шифры RC5, тройной DES, IDEA, BlowFish, CAST.

** Управление ключами

Управление ключами может быть ручное (когда администратор сам вводит ключи в систему) и автоматизированное. Для автоматизированного применяя протокол ISAKMP/OAKLEY. OAKLEY --- протокол управления ключами основан на алгоритме Диффи-Хеллмана.

К обычному Диффи-Хеллману в нём добавлена аутентификация сторон, обменивающихся ключами. Аутентификация может быть выполнена с помощью ЭЦП или алгоритмов шифрования.

