html/IBST_Lectures.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Протокол IPsec </h2>
<div class="outline-text-2" id="text-4">


<p>
Протокол IPsec обеспечивает защиту обмена данными в сетях за счёт шифрования и (или) аутентификации всего потока данных на уровне IP.
</p>
<p>
Протокол может работать в двух режимах:
</p><ol>
<li>
Транспортный. В этом режиме защищаются только данные из IP-дейтаграмм, а заголовок IP-дейтаграммы не защищается.
</li>
<li>
Туннельный. В этом режиме защищается вся IP-дейтаграмма. Для этого к защищённой IP-дейтаграмме добавляется новый IP-заголовок, никак не защищённый. Обычно в нём указывается IP-адрес маршрутизатора или шлюза, который стоит в сети конечного получателя.
</li>
</ol>


<p>
IPsec поддерживает два протокола защиты:
</p><ol>
<li>
Аутентификация AH.
</li>
<li>
Протокол шифрования аутентификации ESP.
</li>
</ol>


<p>
Внутри каждого из этих протоколов может использоваться несколько различных алгоритмов.
</p>
<p>
Дополнительно в протоколе IPsec определён протокол распределения ключей.
</p>
<p>
Заголовок аутентификации обеспечивает аутентификацию IP-дейтаграмм и проверку целостности данных в нём.
</p>
<p>
Заголовок состоит из следующих полей:
</p><ol>
<li>
Следующий заголовок. Длина 8 бит.
</li>
<li>
Длина. Здесь длина заголовка в 32-битных единицах минус 2.
</li>
<li>
Зарезервированных 16 бит.
</li>
<li>
Индекс параметров защиты. Длина 32 бита. Он идентифицирует защищённую связь.
</li>
<li>
Порядковый номер. Длина 32 бита. Порядковый номер дейтаграммы, который был послан по данной защищённой связи.
</li>
<li>
Данные аутентификации. В нём содержится код аутентификации.
</li>
</ol>



</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Защищённая связь </h3>
<div class="outline-text-3" id="text-4_1">


<p>
Связь &mdash; односторонние отношения между отправителем и получателем.
</p>
<p>
Связь определяется параметрами:
</p><ol>
<li>
Индекс параметров защиты. Строка битов, которая обозначает некий условный номер этой связи. По нему определяются алгоритмы обработки принятого пакета.
</li>
<li>
IP-адрес получателя.
</li>
<li>
Идентификатор протокола защиты. Параметры защищённой связи хранятся в специальных таблицах. В этих таблицах записаны:
<ul>
<li>
счётчик порядкового номера;
</li>
<li>
флаг переполнения счётчика порядкового номера;
</li>
<li>
окно защиты от воспроизведения. Для защиты от повторной передачи одних и тех же дейтаграмм.
</li>
</ul>
</li>
<li>
Информация AH. Хранятся параметры для алгоритма аутентификации.
</li>
<li>
Информация ESP. В нём хранятся параметры выбранного алгоритма шифрования.
</li>
<li>
Время жизни защищённой связи. Это интервал времени или значение счётчика байтов, по достижении которого связь уничтожается.
</li>
<li>
Режим IPsec.
</li>
<li>
Максимальная единица передачи маршрута. Максимальный размер пакета, который может быть передан без фрагментации.
</li>
</ol>


<p>
Защищённые связи связываются с потоком IP через селекторы. Эти селекторы хранятся в базе данных политики защиты. Деление потоков может осуществляться по IP адресам пункта назначения, IP адресам источников, по протоколу транспортного уровня, по метке потока протокола IPv6 и т. п.
</p>
</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> Формат пакетов ESP </h3>
<div class="outline-text-3" id="text-4_2">


<ol>
<li>
Индекс параметров защиты. Длина 32 бита. Номер защищённой связи.
</li>
<li>
Порядковый номер дейтаграммы. Длина 32 бита.
</li>
<li>
Передаваемые данные.
</li>
<li>
Заполнитель. Нужен для правильной работы алгоритма шифрования.
</li>
<li>
Длина заполнителя.
</li>
<li>
Следующий заголовок. Длина 8 бит.
</li>
<li>
Данные аутентификации. Вычисляется для всей дейтаграммы ESP.
</li>
</ol>


<p>
Шифры RC5, тройной DES, IDEA, BlowFish, CAST.
</p>
</div>

</div>

<div id="outline-container-4_3" class="outline-3">
<h3 id="sec-4_3"><span class="section-number-3">4.3</span> Управление ключами </h3>
<div class="outline-text-3" id="text-4_3">


<p>
Управление ключами может быть ручное (когда администратор сам вводит ключи в систему) и автоматизированное. Для автоматизированного применяя протокол ISAKMP/OAKLEY. OAKLEY &mdash; протокол управления ключами основан на алгоритме Диффи-Хеллмана.
</p>
<p>
К обычному Диффи-Хеллману в нём добавлена аутентификация сторон, обменивающихся ключами. Аутентификация может быть выполнена с помощью ЭЦП или алгоритмов шифрования.
</p>
</div>

</div>
