other/IBST_Lectures.tex
\section{Протокол IPsec}
\label{sec-4}


Протокол IPsec обеспечивает защиту обмена данными в сетях за счёт шифрования и (или) аутентификации всего потока данных на уровне IP.

Протокол может работать в двух режимах:
\begin{enumerate}
\item Транспортный. В этом режиме защищаются только данные из IP-дейтаграмм, а заголовок IP-дейтаграммы не защищается.
\item Туннельный. В этом режиме защищается вся IP-дейтаграмма. Для этого к защищённой IP-дейтаграмме добавляется новый IP-заголовок, никак не защищённый. Обычно в нём указывается IP-адрес маршрутизатора или шлюза, который стоит в сети конечного получателя.
\end{enumerate}

IPsec поддерживает два протокола защиты:
\begin{enumerate}
\item Аутентификация AH.
\item Протокол шифрования аутентификации ESP.
\end{enumerate}

Внутри каждого из этих протоколов может использоваться несколько различных алгоритмов.

Дополнительно в протоколе IPsec определён протокол распределения ключей.

Заголовок аутентификации обеспечивает аутентификацию IP-дейтаграмм и проверку целостности данных в нём.

Заголовок состоит из следующих полей:
\begin{enumerate}
\item Следующий заголовок. Длина 8 бит.
\item Длина. Здесь длина заголовка в 32-битных единицах минус 2.
\item Зарезервированных 16 бит.
\item Индекс параметров защиты. Длина 32 бита. Он идентифицирует защищённую связь.
\item Порядковый номер. Длина 32 бита. Порядковый номер дейтаграммы, который был послан по данной защищённой связи.
\item Данные аутентификации. В нём содержится код аутентификации.
\end{enumerate}
\subsection{Защищённая связь}
\label{sec-4_1}


Связь --- односторонние отношения между отправителем и получателем.

Связь определяется параметрами:
\begin{enumerate}
\item Индекс параметров защиты. Строка битов, которая обозначает некий условный номер этой связи. По нему определяются алгоритмы обработки принятого пакета.
\item IP-адрес получателя.
\item Идентификатор протокола защиты. Параметры защищённой связи хранятся в специальных таблицах. В этих таблицах записаны:

\begin{itemize}
\item счётчик порядкового номера;
\item флаг переполнения счётчика порядкового номера;
\item окно защиты от воспроизведения. Для защиты от повторной передачи одних и тех же дейтаграмм.
\end{itemize}

\item Информация AH. Хранятся параметры для алгоритма аутентификации.
\item Информация ESP. В нём хранятся параметры выбранного алгоритма шифрования.
\item Время жизни защищённой связи. Это интервал времени или значение счётчика байтов, по достижении которого связь уничтожается.
\item Режим IPsec.
\item Максимальная единица передачи маршрута. Максимальный размер пакета, который может быть передан без фрагментации.
\end{enumerate}

Защищённые связи связываются с потоком IP через селекторы. Эти селекторы хранятся в базе данных политики защиты. Деление потоков может осуществляться по IP адресам пункта назначения, IP адресам источников, по протоколу транспортного уровня, по метке потока протокола IPv6 и т. п.
\subsection{Формат пакетов ESP}
\label{sec-4_2}


\begin{enumerate}
\item Индекс параметров защиты. Длина 32 бита. Номер защищённой связи.
\item Порядковый номер дейтаграммы. Длина 32 бита.
\item Передаваемые данные.
\item Заполнитель. Нужен для правильной работы алгоритма шифрования.
\item Длина заполнителя.
\item Следующий заголовок. Длина 8 бит.
\item Данные аутентификации. Вычисляется для всей дейтаграммы ESP.
\end{enumerate}

Шифры RC5, тройной DES, IDEA, BlowFish, CAST.
\subsection{Управление ключами}
\label{sec-4_3}


Управление ключами может быть ручное (когда администратор сам вводит ключи в систему) и автоматизированное. Для автоматизированного применяя протокол ISAKMP/OAKLEY. OAKLEY --- протокол управления ключами основан на алгоритме Диффи-Хеллмана.

К обычному Диффи-Хеллману в нём добавлена аутентификация сторон, обменивающихся ключами. Аутентификация может быть выполнена с помощью ЭЦП или алгоритмов шифрования.
