IBST_Lectures.org
** Протокол ISAKMP

Протокол защищённой связи и управления ключами. Сообщения этого протокола состоят из заголовка и данных. Они передаются с помощью протокола транспортного уровня UDP. В заголовке присутствуют следующие поля:
1) Случайное число, которое генерируется стороной, изменяющей, создающей, удаляющей связь.
2) Случайное число объекта получателя.
3) Следующий полезный груз. В этом поле указывается тип данных, которые передаются в сообщении ISAKMP.
4) Главный номер версии.
5) Дополнительный номер версии.
6) Тип обмена.
7) Флаги. Флаг указывает зашифрованы или нет данные ISAKMP.
8) Бит фиксации. Он нужен, чтобы удостовериться, что сначала была создана защищённая связь, а потом получены соответствующие пакеты ISAKMP.
9) Универсальный идентификатор сообщения.
10) Длина сообщения в байтах.

Типы полезного груза:
1) Защищённая связь. Нужна, чтобы начать процесс создания защищённой связи.
2) Тип предложения. В нём указывается применяемый протокол ESP/AH, число трасформаций.
3) Трасформация. В каждой трасформации передаются атрибуты используемого алгоритма шифрования или аутентификации. Трансформаций может быть указано несколько.
4) Тип обмена ключами.
5) Идентификация. Предназначена для аутентификации связывающих сторон.
6) Сертификат. Сертификат открытого ключа.
7) Цифровая подпись.
8) Хеширование.
9) Запрос сертификата.
10) Нонс. Случайное число. Оно нужно, чтобы обеспечить защиту от атак воспроизведения сообщений и обеспечить процесс обмена сообщениями в реальном времени.
11) Тип уведомления.
12) Тип удаления. Удаление защищённой связи.

** Тип обмена

1) Базовый обмен. Происходить обмен ключами и данными аутентификации одновременно.
2) Обмен с защитой идентификации сторон.
3) Обмен только данными аутентификации.
4) Обмен без идентификации сторон.
5) Информационный обмен. Нужен для передачи сообщений о параметрах управления защищённой связью.

* Протоколы транспортного уровня

** TCP

Протокол TCP является пакетным. Пакеты называются сегментами. Каждый сегмент имеет заголовок.

Формат /заголовка/:
1) Порт отправителя. Длина 16 бит.
2) Порт получателя. Длина 16 бит.
3) Позиция сегмента.
4) Первый ожидаемый байт. Используется только, если сегмент --- это квитанция.
5) Смещение данных. Это длина заголовка в 32-разрядных словах. Длина 4 бита.
6) 6 бит неиспользуемых.
7) Флаги. 6 флагов.
   - URG. Срочность данных.
   - ACH. Квитанция.
   - PSH. Сегмент послать в первую очередь.
   - RST. Запрос на установку первоначальных параметров соединения.
   - SYN. Синхронизация счётчиков переданных данных при установлении соединения.
   - FIN. Отправлен последний бит сообщения.
8) Размер окна. В нём указывается сколько байт готов принять получатель.
9) Контрольная сумма. Длина 16 бит. Контрольная сумма вычисляется на весь сегмент + IP адреса отправителя и получателя, идентификатор протокола и длину сегмента.
10) Указатель срочности данных.
11) Опции.
    - 0 --- конец списка опций.
    - 1 --- отсутствие операции.
    - 2 --- максимальный размер сегмента.
12) Заполнитель. Дополняет заголовок до целого числа 32-разрядных слов.
13) Поле данных. Размер не фиксирован (максимальный указан в опции максимальный размер сегмента).

/Номер порта/ --- число, которое однозначно определяет приложение, осуществляющее сетевой обмен. Каждому приложения записан определённый номер порта.

/Сокет/ --- число, в которое входит IP адрес компьютера и номер порта. Однозначно определяет связь между процессами через протокол TCP.

Т. к. TCP отвечает за гарантированную доставку сообщений, поэтому передача сообщения происходит после установления соединения между отправителем и получателем. На каждую переданную дейтаграмму (сегмент) получатель должен послать квитанцию

