html/IBST_Lectures.html

<div id="outline-container-4_4" class="outline-3">
<h3 id="sec-4_4"><span class="section-number-3">4.4</span> Протокол ISAKMP </h3>
<div class="outline-text-3" id="text-4_4">


<p>
Протокол защищённой связи и управления ключами. Сообщения этого протокола состоят из заголовка и данных. Они передаются с помощью протокола транспортного уровня UDP. В заголовке присутствуют следующие поля:
</p><ol>
<li>
Случайное число, которое генерируется стороной, изменяющей, создающей, удаляющей связь.
</li>
<li>
Случайное число объекта получателя.
</li>
<li>
Следующий полезный груз. В этом поле указывается тип данных, которые передаются в сообщении ISAKMP.
</li>
<li>
Главный номер версии.
</li>
<li>
Дополнительный номер версии.
</li>
<li>
Тип обмена.
</li>
<li>
Флаги. Флаг указывает зашифрованы или нет данные ISAKMP.
</li>
<li>
Бит фиксации. Он нужен, чтобы удостовериться, что сначала была создана защищённая связь, а потом получены соответствующие пакеты ISAKMP.
</li>
<li>
Универсальный идентификатор сообщения.
</li>
<li>
Длина сообщения в байтах.
</li>
</ol>


<p>
Типы полезного груза:
</p><ol>
<li>
Защищённая связь. Нужна, чтобы начать процесс создания защищённой связи.
</li>
<li>
Тип предложения. В нём указывается применяемый протокол ESP/AH, число трасформаций.
</li>
<li>
Трасформация. В каждой трасформации передаются атрибуты используемого алгоритма шифрования или аутентификации. Трансформаций может быть указано несколько.
</li>
<li>
Тип обмена ключами.
</li>
<li>
Идентификация. Предназначена для аутентификации связывающих сторон.
</li>
<li>
Сертификат. Сертификат открытого ключа.
</li>
<li>
Цифровая подпись.
</li>
<li>
Хеширование.
</li>
<li>
Запрос сертификата.
</li>
<li>
Нонс. Случайное число. Оно нужно, чтобы обеспечить защиту от атак воспроизведения сообщений и обеспечить процесс обмена сообщениями в реальном времени.
</li>
<li>
Тип уведомления.
</li>
<li>
Тип удаления. Удаление защищённой связи.
</li>
</ol>


</div>

</div>

<div id="outline-container-4_5" class="outline-3">
<h3 id="sec-4_5"><span class="section-number-3">4.5</span> Тип обмена </h3>
<div class="outline-text-3" id="text-4_5">


<ol>
<li>
Базовый обмен. Происходить обмен ключами и данными аутентификации одновременно.
</li>
<li>
Обмен с защитой идентификации сторон.
</li>
<li>
Обмен только данными аутентификации.
</li>
<li>
Обмен без идентификации сторон.
</li>
<li>
Информационный обмен. Нужен для передачи сообщений о параметрах управления защищённой связью.
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Протоколы транспортного уровня </h2>
<div class="outline-text-2" id="text-5">



</div>

<div id="outline-container-5_1" class="outline-3">
<h3 id="sec-5_1"><span class="section-number-3">5.1</span> TCP </h3>
<div class="outline-text-3" id="text-5_1">


<p>
Протокол TCP является пакетным. Пакеты называются сегментами. Каждый сегмент имеет заголовок.
</p>
<p>
Формат <i>заголовка</i>:
</p><ol>
<li>
Порт отправителя. Длина 16 бит.
</li>
<li>
Порт получателя. Длина 16 бит.
</li>
<li>
Позиция сегмента.
</li>
<li>
Первый ожидаемый байт. Используется только, если сегмент &mdash; это квитанция.
</li>
<li>
Смещение данных. Это длина заголовка в 32-разрядных словах. Длина 4 бита.
</li>
<li>
6 бит неиспользуемых.
</li>
<li>
Флаги. 6 флагов.
<ul>
<li>
URG. Срочность данных.
</li>
<li>
ACH. Квитанция.
</li>
<li>
PSH. Сегмент послать в первую очередь.
</li>
<li>
RST. Запрос на установку первоначальных параметров соединения.
</li>
<li>
SYN. Синхронизация счётчиков переданных данных при установлении соединения.
</li>
<li>
FIN. Отправлен последний бит сообщения.
</li>
</ul>
</li>
<li>
Размер окна. В нём указывается сколько байт готов принять получатель.
</li>
<li>
Контрольная сумма. Длина 16 бит. Контрольная сумма вычисляется на весь сегмент + IP адреса отправителя и получателя, идентификатор протокола и длину сегмента.
</li>
<li>
Указатель срочности данных.
</li>
<li>
Опции.
<ul>
<li>
0 &mdash; конец списка опций.
</li>
<li>
1 &mdash; отсутствие операции.
</li>
<li>
2 &mdash; максимальный размер сегмента.
</li>
</ul>
</li>
<li>
Заполнитель. Дополняет заголовок до целого числа 32-разрядных слов.
</li>
<li>
Поле данных. Размер не фиксирован (максимальный указан в опции максимальный размер сегмента).
</li>
</ol>


<p>
<i>Номер порта</i> &mdash; число, которое однозначно определяет приложение, осуществляющее сетевой обмен. Каждому приложения записан определённый номер порта.
</p>
<p>
<i>Сокет</i> &mdash; число, в которое входит IP адрес компьютера и номер порта. Однозначно определяет связь между процессами через протокол TCP.
</p>
<p>
Т. к. TCP отвечает за гарантированную доставку сообщений, поэтому передача сообщения происходит после установления соединения между отправителем и получателем. На каждую переданную дейтаграмму (сегмент) получатель должен послать квитанцию
</p>

</div>
