other/IBST_Lectures.tex
\subsection{Протокол ISAKMP}
\label{sec-4_4}


Протокол защищённой связи и управления ключами. Сообщения этого протокола состоят из заголовка и данных. Они передаются с помощью протокола транспортного уровня UDP. В заголовке присутствуют следующие поля:
\begin{enumerate}
\item Случайное число, которое генерируется стороной, изменяющей, создающей, удаляющей связь.
\item Случайное число объекта получателя.
\item Следующий полезный груз. В этом поле указывается тип данных, которые передаются в сообщении ISAKMP.
\item Главный номер версии.
\item Дополнительный номер версии.
\item Тип обмена.
\item Флаги. Флаг указывает зашифрованы или нет данные ISAKMP.
\item Бит фиксации. Он нужен, чтобы удостовериться, что сначала была создана защищённая связь, а потом получены соответствующие пакеты ISAKMP.
\item Универсальный идентификатор сообщения.
\item Длина сообщения в байтах.
\end{enumerate}

Типы полезного груза:
\begin{enumerate}
\item Защищённая связь. Нужна, чтобы начать процесс создания защищённой связи.
\item Тип предложения. В нём указывается применяемый протокол ESP/AH, число трасформаций.
\item Трасформация. В каждой трасформации передаются атрибуты используемого алгоритма шифрования или аутентификации. Трансформаций может быть указано несколько.
\item Тип обмена ключами.
\item Идентификация. Предназначена для аутентификации связывающих сторон.
\item Сертификат. Сертификат открытого ключа.
\item Цифровая подпись.
\item Хеширование.
\item Запрос сертификата.
\item Нонс. Случайное число. Оно нужно, чтобы обеспечить защиту от атак воспроизведения сообщений и обеспечить процесс обмена сообщениями в реальном времени.
\item Тип уведомления.
\item Тип удаления. Удаление защищённой связи.
\end{enumerate}
\subsection{Тип обмена}
\label{sec-4_5}


\begin{enumerate}
\item Базовый обмен. Происходить обмен ключами и данными аутентификации одновременно.
\item Обмен с защитой идентификации сторон.
\item Обмен только данными аутентификации.
\item Обмен без идентификации сторон.
\item Информационный обмен. Нужен для передачи сообщений о параметрах управления защищённой связью.
\end{enumerate}
\section{Протоколы транспортного уровня}
\label{sec-5}
\subsection{TCP}
\label{sec-5_1}


Протокол TCP является пакетным. Пакеты называются сегментами. Каждый сегмент имеет заголовок.

Формат \emph{заголовка}:
\begin{enumerate}
\item Порт отправителя. Длина 16 бит.
\item Порт получателя. Длина 16 бит.
\item Позиция сегмента.
\item Первый ожидаемый байт. Используется только, если сегмент --- это квитанция.
\item Смещение данных. Это длина заголовка в 32-разрядных словах. Длина 4 бита.
\item 6 бит неиспользуемых.
\item Флаги. 6 флагов.

\begin{itemize}
\item URG. Срочность данных.
\item ACH. Квитанция.
\item PSH. Сегмент послать в первую очередь.
\item RST. Запрос на установку первоначальных параметров соединения.
\item SYN. Синхронизация счётчиков переданных данных при установлении соединения.
\item FIN. Отправлен последний бит сообщения.
\end{itemize}

\item Размер окна. В нём указывается сколько байт готов принять получатель.
\item Контрольная сумма. Длина 16 бит. Контрольная сумма вычисляется на весь сегмент + IP адреса отправителя и получателя, идентификатор протокола и длину сегмента.
\item Указатель срочности данных.
\item Опции.

\begin{itemize}
\item 0 --- конец списка опций.
\item 1 --- отсутствие операции.
\item 2 --- максимальный размер сегмента.
\end{itemize}

\item Заполнитель. Дополняет заголовок до целого числа 32-разрядных слов.
\item Поле данных. Размер не фиксирован (максимальный указан в опции максимальный размер сегмента).
\end{enumerate}

\emph{Номер порта} --- число, которое однозначно определяет приложение, осуществляющее сетевой обмен. Каждому приложения записан определённый номер порта.

\emph{Сокет} --- число, в которое входит IP адрес компьютера и номер порта. Однозначно определяет связь между процессами через протокол TCP.

Т. к. TCP отвечает за гарантированную доставку сообщений, поэтому передача сообщения происходит после установления соединения между отправителем и получателем. На каждую переданную дейтаграмму (сегмент) получатель должен послать квитанцию
