IBST_Lectures.org
*** Передача сообщения

Сообщение от прикладного уровня является потоком, представляет собой последовательность байт фиксированной длины, передаваемых асинхронно.
TCP разбивает этот поток на сегменты и к каждому из них добавляет соответствующий заголовок. Длина сегмента задаётся администратором или определяется автоматически протоколом TCP.

Сначала происходит установление соединения. Отправитель посылает сегмент, в котором содержится номер сокета. В заголовке флаг SYN установлен в единицу. В ответ получатель посылает номер своего сокета. При этом в заголовке установлены флаги SYN и ASK. Отправитель посылает сегмент, в заголовке которого флаг ASK установлен в 1 и в поле, где указывается номер сегмента устанавливается 1. На этом процесс соединения заканчивается.

Если сообщение состоит из нескольких TCP сегментов, то получатель собирает его согласно порядковых номеров, хранящихся в заголовке. Если сегмент потерян или повреждён, то отправителю посылается сообщение, содержащее порядковый номер этого сегмента. Отправитель повторно передаёт запрошенный сегмент. Если сообщение принято, то посылается квитанция.

В последнем сегменте сообщения в заголовке должен быть установлен флаг FIN. После этого соединение разрывается.

Чтобы предотвратить переполнение буфера получателя используется т. н. скользящее окно, т. е. в заголовке передаётся размер окна, который может принять получатель.

В протоколе TCP используется несколько таймеров:
1) Таймер повтора передачи. Устанавливает время ожидания квитанции. Если квитанция за этот промежуток времени не поступает, сегмент считается потерянным и отправляется вновь. Повторная передача происходит заданное число раз. Если передача не удалась, то на прикладной уровень сообщается об ошибке.
2) Таймер задержки. Нужен, чтобы исключить повторное открытие только что закрытого порта, которое может быть вызвано прибывшими сегментами. Задержка может достигать 30 сек.
3) Таймер запроса. Нужен когда получатель приостановивший приём данных отправляет сообщение о возобновлении работы, но не получает подтверждения. Чтобы продолжить передачу, отправитель посылает запросы с периодом, заданным этим таймером.
4) Таймер контроля. Он вызывает периодическую передачу сегментов без данных. Нужен для проверки сети. Значение между 5--45 секундами.
5) Таймер разъединения. Задаёт максимальное время ожидания ответа. По истечении этого срока соединение разрывается. Максимальное время обычно равно 360 сек.

** UDP

Это протокол транспортного уровня. Передача данных в нём происходит без установления соединения. Отправителю никак не сообщается доставлено ли его сообщение, правильно ли оно принято. Исправление ошибок происходит либо на сетевом, либо на прикладном уровне. Управление потоком данных не предусмотрено.

Заголовок UPD дейтаграммы:
1) Порт отправителя. Длина 16 бит. Поле необязательное.
2) Порт получателя. Длина 16 бит. Поле обязательно.
3) Длина дейтаграммы. Длина 16 бит.
4) Контрольная сумма. Длина 16 бит. Вычисляется также, как в протоколе TCP.
5) Данные.

* Дополнительная лекция

** IP адресация

IP адрес является уникальным 32-битным идентификатором IP интерфейса в сети Интернет, т. е. если у хоста несколько интерфейсов, у него будет несколько IP адресов.

IP адрес принято записывать в десятичном виде с разбивкой 32-битного числа по октетам. IP адрес состоит из 2 частей. Старшие разряды являются адресом сети, младшие разряды --- адресом хоста. Граница разделов 2 частей определяются маской (subnet mask).

/Маска/ --- 32-битовая комбинация, в которой единицы установлены на сетевой части адреса, а нули на хостовой.

** Классовая модель адресов

Существуют 5 классов адресов:
1) A. 255.0.0.0. Диапазон 0.0.0.0 - 127.0.0.0
2) B. 255.255.0.0. Диапазон 128.0.0.0 - 192.255.0.0
3) C. 255.255.255.0. Диапазон 193.0.0.0 - 223.255.255.255.0
4) D. Сеть мультиадресной рассылки. Адреса этого диапазона могут быть присвоены нескольким сетевым интерфейсам. Диапазон 224.0.0.0 - 239.0.0.0
5) E. Диапазон 240.0.0.0 - 255.255.255.255

