html/IBST_Lectures.html

<div id="outline-container-5_1_1" class="outline-4">
<h4 id="sec-5_1_1"><span class="section-number-4">5.1.1</span> Передача сообщения </h4>
<div class="outline-text-4" id="text-5_1_1">


<p>
Сообщение от прикладного уровня является потоком, представляет собой последовательность байт фиксированной длины, передаваемых асинхронно.
TCP разбивает этот поток на сегменты и к каждому из них добавляет соответствующий заголовок. Длина сегмента задаётся администратором или определяется автоматически протоколом TCP.
</p>
<p>
Сначала происходит установление соединения. Отправитель посылает сегмент, в котором содержится номер сокета. В заголовке флаг SYN установлен в единицу. В ответ получатель посылает номер своего сокета. При этом в заголовке установлены флаги SYN и ASK. Отправитель посылает сегмент, в заголовке которого флаг ASK установлен в 1 и в поле, где указывается номер сегмента устанавливается 1. На этом процесс соединения заканчивается.
</p>
<p>
Если сообщение состоит из нескольких TCP сегментов, то получатель собирает его согласно порядковых номеров, хранящихся в заголовке. Если сегмент потерян или повреждён, то отправителю посылается сообщение, содержащее порядковый номер этого сегмента. Отправитель повторно передаёт запрошенный сегмент. Если сообщение принято, то посылается квитанция.
</p>
<p>
В последнем сегменте сообщения в заголовке должен быть установлен флаг FIN. После этого соединение разрывается.
</p>
<p>
Чтобы предотвратить переполнение буфера получателя используется т. н. скользящее окно, т. е. в заголовке передаётся размер окна, который может принять получатель.
</p>
<p>
В протоколе TCP используется несколько таймеров:
</p><ol>
<li>
Таймер повтора передачи. Устанавливает время ожидания квитанции. Если квитанция за этот промежуток времени не поступает, сегмент считается потерянным и отправляется вновь. Повторная передача происходит заданное число раз. Если передача не удалась, то на прикладной уровень сообщается об ошибке.
</li>
<li>
Таймер задержки. Нужен, чтобы исключить повторное открытие только что закрытого порта, которое может быть вызвано прибывшими сегментами. Задержка может достигать 30 сек.
</li>
<li>
Таймер запроса. Нужен когда получатель приостановивший приём данных отправляет сообщение о возобновлении работы, но не получает подтверждения. Чтобы продолжить передачу, отправитель посылает запросы с периодом, заданным этим таймером.
</li>
<li>
Таймер контроля. Он вызывает периодическую передачу сегментов без данных. Нужен для проверки сети. Значение между 5&ndash;45 секундами.
</li>
<li>
Таймер разъединения. Задаёт максимальное время ожидания ответа. По истечении этого срока соединение разрывается. Максимальное время обычно равно 360 сек.
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-5_2" class="outline-3">
<h3 id="sec-5_2"><span class="section-number-3">5.2</span> UDP </h3>
<div class="outline-text-3" id="text-5_2">


<p>
Это протокол транспортного уровня. Передача данных в нём происходит без установления соединения. Отправителю никак не сообщается доставлено ли его сообщение, правильно ли оно принято. Исправление ошибок происходит либо на сетевом, либо на прикладном уровне. Управление потоком данных не предусмотрено.
</p>
<p>
Заголовок UPD дейтаграммы:
</p><ol>
<li>
Порт отправителя. Длина 16 бит. Поле необязательное.
</li>
<li>
Порт получателя. Длина 16 бит. Поле обязательно.
</li>
<li>
Длина дейтаграммы. Длина 16 бит.
</li>
<li>
Контрольная сумма. Длина 16 бит. Вычисляется также, как в протоколе TCP.
</li>
<li>
Данные.
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Дополнительная лекция </h2>
<div class="outline-text-2" id="text-6">



</div>

<div id="outline-container-6_1" class="outline-3">
<h3 id="sec-6_1"><span class="section-number-3">6.1</span> IP адресация </h3>
<div class="outline-text-3" id="text-6_1">


<p>
IP адрес является уникальным 32-битным идентификатором IP интерфейса в сети Интернет, т. е. если у хоста несколько интерфейсов, у него будет несколько IP адресов.
</p>
<p>
IP адрес принято записывать в десятичном виде с разбивкой 32-битного числа по октетам. IP адрес состоит из 2 частей. Старшие разряды являются адресом сети, младшие разряды &mdash; адресом хоста. Граница разделов 2 частей определяются маской (subnet mask).
</p>
<p>
<i>Маска</i> &mdash; 32-битовая комбинация, в которой единицы установлены на сетевой части адреса, а нули на хостовой.
</p>
</div>

</div>

<div id="outline-container-6_2" class="outline-3">
<h3 id="sec-6_2"><span class="section-number-3">6.2</span> Классовая модель адресов </h3>
<div class="outline-text-3" id="text-6_2">


<p>
Существуют 5 классов адресов:
</p><ol>
<li>
A. 255.0.0.0. Диапазон 0.0.0.0 - 127.0.0.0
</li>
<li>
B. 255.255.0.0. Диапазон 128.0.0.0 - 192.255.0.0
</li>
<li>
C. 255.255.255.0. Диапазон 193.0.0.0 - 223.255.255.255.0
</li>
<li>
D. Сеть мультиадресной рассылки. Адреса этого диапазона могут быть присвоены нескольким сетевым интерфейсам. Диапазон 224.0.0.0 - 239.0.0.0
</li>
<li>
E. Диапазон 240.0.0.0 - 255.255.255.255
</li>
</ol>


</div>

</div>
