other/IBST_Lectures.tex
\subsubsection{Передача сообщения}
\label{sec-5_1_1}


Сообщение от прикладного уровня является потоком, представляет собой последовательность байт фиксированной длины, передаваемых асинхронно.
TCP разбивает этот поток на сегменты и к каждому из них добавляет соответствующий заголовок. Длина сегмента задаётся администратором или определяется автоматически протоколом TCP.

Сначала происходит установление соединения. Отправитель посылает сегмент, в котором содержится номер сокета. В заголовке флаг SYN установлен в единицу. В ответ получатель посылает номер своего сокета. При этом в заголовке установлены флаги SYN и ASK. Отправитель посылает сегмент, в заголовке которого флаг ASK установлен в 1 и в поле, где указывается номер сегмента устанавливается 1. На этом процесс соединения заканчивается.

Если сообщение состоит из нескольких TCP сегментов, то получатель собирает его согласно порядковых номеров, хранящихся в заголовке. Если сегмент потерян или повреждён, то отправителю посылается сообщение, содержащее порядковый номер этого сегмента. Отправитель повторно передаёт запрошенный сегмент. Если сообщение принято, то посылается квитанция.

В последнем сегменте сообщения в заголовке должен быть установлен флаг FIN. После этого соединение разрывается.

Чтобы предотвратить переполнение буфера получателя используется т. н. скользящее окно, т. е. в заголовке передаётся размер окна, который может принять получатель.

В протоколе TCP используется несколько таймеров:
\begin{enumerate}
\item Таймер повтора передачи. Устанавливает время ожидания квитанции. Если квитанция за этот промежуток времени не поступает, сегмент считается потерянным и отправляется вновь. Повторная передача происходит заданное число раз. Если передача не удалась, то на прикладной уровень сообщается об ошибке.
\item Таймер задержки. Нужен, чтобы исключить повторное открытие только что закрытого порта, которое может быть вызвано прибывшими сегментами. Задержка может достигать 30 сек.
\item Таймер запроса. Нужен когда получатель приостановивший приём данных отправляет сообщение о возобновлении работы, но не получает подтверждения. Чтобы продолжить передачу, отправитель посылает запросы с периодом, заданным этим таймером.
\item Таймер контроля. Он вызывает периодическую передачу сегментов без данных. Нужен для проверки сети. Значение между 5--45 секундами.
\item Таймер разъединения. Задаёт максимальное время ожидания ответа. По истечении этого срока соединение разрывается. Максимальное время обычно равно 360 сек.
\end{enumerate}
\subsection{UDP}
\label{sec-5_2}


Это протокол транспортного уровня. Передача данных в нём происходит без установления соединения. Отправителю никак не сообщается доставлено ли его сообщение, правильно ли оно принято. Исправление ошибок происходит либо на сетевом, либо на прикладном уровне. Управление потоком данных не предусмотрено.

Заголовок UPD дейтаграммы:
\begin{enumerate}
\item Порт отправителя. Длина 16 бит. Поле необязательное.
\item Порт получателя. Длина 16 бит. Поле обязательно.
\item Длина дейтаграммы. Длина 16 бит.
\item Контрольная сумма. Длина 16 бит. Вычисляется также, как в протоколе TCP.
\item Данные.
\end{enumerate}
\section{Дополнительная лекция}
\label{sec-6}
\subsection{IP адресация}
\label{sec-6_1}


IP адрес является уникальным 32-битным идентификатором IP интерфейса в сети Интернет, т. е. если у хоста несколько интерфейсов, у него будет несколько IP адресов.

IP адрес принято записывать в десятичном виде с разбивкой 32-битного числа по октетам. IP адрес состоит из 2 частей. Старшие разряды являются адресом сети, младшие разряды --- адресом хоста. Граница разделов 2 частей определяются маской (subnet mask).

\emph{Маска} --- 32-битовая комбинация, в которой единицы установлены на сетевой части адреса, а нули на хостовой.
\subsection{Классовая модель адресов}
\label{sec-6_2}


Существуют 5 классов адресов:
\begin{enumerate}
\item A. 255.0.0.0. Диапазон 0.0.0.0 - 127.0.0.0
\item B. 255.255.0.0. Диапазон 128.0.0.0 - 192.255.0.0
\item C. 255.255.255.0. Диапазон 193.0.0.0 - 223.255.255.255.0
\item D. Сеть мультиадресной рассылки. Адреса этого диапазона могут быть присвоены нескольким сетевым интерфейсам. Диапазон 224.0.0.0 - 239.0.0.0
\item E. Диапазон 240.0.0.0 - 255.255.255.255
\end{enumerate}
