IBST_Lectures.org
** Специальные IP адреса

- 0.0.0.0 --- маршрут по умолчанию (default road). Используется в маршрутных таблицах для указания направления передачи пакетов, адресат которых неизвестен.
- 255.255.255.255 --- широковещательный адрес (broadcast) локальной сети, в которой абонент находится.
- адрес, у которого хостовая часть нулевая называется адресом сети и он не может быть присвоен никакому хосту.
- адрес, у которого хостовая часть единицы называется широковещательным адресом удалённой сети. Он не может быть присвоен хосту.
- 127.0.0.0 --- сеть обратной связи (loopback). В ней определён только один интерфейс --- 127.0.0.1. Любой пакет, отправленный по адресу 127.0.0.1 будет принят этим же узлом так, как если бы он пришёл из сети. Используется для отладки сетевых сервисов без подключения к реальной сети.

** Серые адреса

Любой пакет, отправленный по серому адресу будет отброшен маршрутизаторами сети Интернет и останется в пределах локальной сети. Поэтому адреса из серых диапазонов могут иметь несколько хостов в разных локальных сетях.

- A: 10.0.0.0
- B: 172.16.0.0 - 172.32.0.0
- C: 192.168.0.0 - 172.168.255.0

Для доступа с серого адреса к сети Интернет используется специальное устройство --- прокси сервер, которое реализует функции трансляции адресов NAT.

** Бесклассовая модель

1000000 128

1100000 192

1110000 224

1111000 240

1111100 248

1111110 254

Для получения адреса сети необходимо IP адрес узла в двоичном виде поразрядно умножить на маску. Для получения адреса хоста IP адрес в двоичном виде поразрядно необходимо умножить на инвертированную маску

Сеть 172.16.40.0/24

3 сети 20 хостов

172.16.40.000/00000

172.16.40.001/00000

172.16.40.010/00000

Диапазон
0: 172.16.40.000/00001 = 1

   172.16.40.000/11110 = 30

1: 172.16.40.001/00001 = 33

   172.16.40.001/11110 = 62

2: 172.16.40.010/00001 = 65

   172.16.40.010/11110 = 94

** Практика

65.179.19.241 

255.255.128.0 маска

Найти адрес сети, хоста, диапазон, широковещательный адрес сети.

Умножить 19 на 128 в двоичном виде поразрядно. 

Адрес сети: 65.179.0.0

128 инвертировать и умножить.

Адрес хоста: 0.0.19.241

Адрес сети: минимальный 65.179.00000000.0000001

максимальный 65.179.127.255

Широковещательный: 65.179.0.255

** Маршрутизация

|   Адрес пол. |      Маска пол. | Маршрутизатор |    Интерфейс | Метрика |
|--------------+-----------------+---------------+--------------+---------|
|  172.16.40.0 | 255.255.255.224 |   172.16.40.1 |  172.16.40.1 |       1 |
| 172.16.40.32 | 255.255.255.224 |  172.16.40.33 | 172.16.40.33 |       1 |
| 172.16.40.64 | 255.255.255.224 |  172.16.40.65 | 172.16.40.65 |       1 |
|      0.0.0.0 |         0.0.0.0 |   65.137.80.1 | 65.137.80.11 |       1 |

