html/IBST_Lectures.html

<div id="outline-container-6_3" class="outline-3">
<h3 id="sec-6_3"><span class="section-number-3">6.3</span> Специальные IP адреса </h3>
<div class="outline-text-3" id="text-6_3">


<ul>
<li>
0.0.0.0 &mdash; маршрут по умолчанию (default road). Используется в маршрутных таблицах для указания направления передачи пакетов, адресат которых неизвестен.
</li>
<li>
255.255.255.255 &mdash; широковещательный адрес (broadcast) локальной сети, в которой абонент находится.
</li>
<li>
адрес, у которого хостовая часть нулевая называется адресом сети и он не может быть присвоен никакому хосту.
</li>
<li>
адрес, у которого хостовая часть единицы называется широковещательным адресом удалённой сети. Он не может быть присвоен хосту.
</li>
<li>
127.0.0.0 &mdash; сеть обратной связи (loopback). В ней определён только один интерфейс &mdash; 127.0.0.1. Любой пакет, отправленный по адресу 127.0.0.1 будет принят этим же узлом так, как если бы он пришёл из сети. Используется для отладки сетевых сервисов без подключения к реальной сети.
</li>
</ul>


</div>

</div>

<div id="outline-container-6_4" class="outline-3">
<h3 id="sec-6_4"><span class="section-number-3">6.4</span> Серые адреса </h3>
<div class="outline-text-3" id="text-6_4">


<p>
Любой пакет, отправленный по серому адресу будет отброшен маршрутизаторами сети Интернет и останется в пределах локальной сети. Поэтому адреса из серых диапазонов могут иметь несколько хостов в разных локальных сетях.
</p>
<ul>
<li>
A: 10.0.0.0
</li>
<li>
B: 172.16.0.0 - 172.32.0.0
</li>
<li>
C: 192.168.0.0 - 172.168.255.0
</li>
</ul>


<p>
Для доступа с серого адреса к сети Интернет используется специальное устройство &mdash; прокси сервер, которое реализует функции трансляции адресов NAT.
</p>
</div>

</div>

<div id="outline-container-6_5" class="outline-3">
<h3 id="sec-6_5"><span class="section-number-3">6.5</span> Бесклассовая модель </h3>
<div class="outline-text-3" id="text-6_5">


<p>
1000000 128
</p>
<p>
1100000 192
</p>
<p>
1110000 224
</p>
<p>
1111000 240
</p>
<p>
1111100 248
</p>
<p>
1111110 254
</p>
<p>
Для получения адреса сети необходимо IP адрес узла в двоичном виде поразрядно умножить на маску. Для получения адреса хоста IP адрес в двоичном виде поразрядно необходимо умножить на инвертированную маску
</p>
<p>
Сеть 172.16.40.0/24
</p>
<p>
3 сети 20 хостов
</p>
<p>
172.16.40.000/00000
</p>
<p>
172.16.40.001/00000
</p>
<p>
172.16.40.010/00000
</p>
<p>
Диапазон
0: 172.16.40.000/00001 = 1
</p>
<p>
172.16.40.000/11110 = 30
</p>
<p>
1: 172.16.40.001/00001 = 33
</p>
<p>
172.16.40.001/11110 = 62
</p>
<p>
2: 172.16.40.010/00001 = 65
</p>
<p>
172.16.40.010/11110 = 94
</p>
</div>

</div>

<div id="outline-container-6_6" class="outline-3">
<h3 id="sec-6_6"><span class="section-number-3">6.6</span> Практика </h3>
<div class="outline-text-3" id="text-6_6">


<p>
65.179.19.241 
</p>
<p>
255.255.128.0 маска
</p>
<p>
Найти адрес сети, хоста, диапазон, широковещательный адрес сети.
</p>
<p>
Умножить 19 на 128 в двоичном виде поразрядно. 
</p>
<p>
Адрес сети: 65.179.0.0
</p>
<p>
128 инвертировать и умножить.
</p>
<p>
Адрес хоста: 0.0.19.241
</p>
<p>
Адрес сети: минимальный 65.179.00000000.0000001
</p>
<p>
максимальный 65.179.127.255
</p>
<p>
Широковещательный: 65.179.0.255
</p>
</div>

</div>

<div id="outline-container-6_7" class="outline-3">
<h3 id="sec-6_7"><span class="section-number-3">6.7</span> Маршрутизация </h3>
<div class="outline-text-3" id="text-6_7">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="right">Адрес пол.</th><th scope="col" class="right">Маска пол.</th><th scope="col" class="right">Маршрутизатор</th><th scope="col" class="right">Интерфейс</th><th scope="col" class="right">Метрика</th></tr>
</thead>
<tbody>
<tr><td class="right">172.16.40.0</td><td class="right">255.255.255.224</td><td class="right">172.16.40.1</td><td class="right">172.16.40.1</td><td class="right">1</td></tr>
<tr><td class="right">172.16.40.32</td><td class="right">255.255.255.224</td><td class="right">172.16.40.33</td><td class="right">172.16.40.33</td><td class="right">1</td></tr>
<tr><td class="right">172.16.40.64</td><td class="right">255.255.255.224</td><td class="right">172.16.40.65</td><td class="right">172.16.40.65</td><td class="right">1</td></tr>
<tr><td class="right">0.0.0.0</td><td class="right">0.0.0.0</td><td class="right">65.137.80.1</td><td class="right">65.137.80.11</td><td class="right">1</td></tr>
</tbody>
</table>


</div>
</div>

</div>
