html/IBST_Lectures.html

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Протокол SSL </h2>
<div class="outline-text-2" id="text-7">


<p>
Протокол SSL предназначен для защищённой передачи данных через протокол TCP. Протокол SSL в стеке протоколов находится над TCP, но ниже протоколов прикладного уровня.
</p>
<p>
Протокол прикладного уровня, который используют SSL &mdash; HTTP.
</p>
<p>
SSL состоит из 4 отдельных протоколов:
<i>Протокол записи</i>. Этот протокол непосредственно взаимодействует с протоколом TCP. Он обеспечивает конфиденциальность сообщений и целостность сообщений. Конфиденциальность обеспечивается за счёт шифрования данных, а целостность сообщений за счёт добавления к данным кода аутентичности (контрольная сумма). Данные приложения разбиваются на фрагменты размером не более 2<sup>14</sup> байт. Потом может быть выполнено сжатие данных. На эти данные вычисляется код аутентичности и этот код добавляется после данных.
</p>
<p>
Сформированный блок шифруется с использованием симметричного алгоритма. К полученному зашифрованному блоку добавляется заголовок протокола записи.
Сформированный пакет поступает на уровень протокола TCP.
</p>
<p>
Алгоритмы шифрования DES. Код аутентичности SHA-1.
</p>
<p>
Поля заголовка:
</p><ol>
<li>
Тип содержимого. Длина 8 бит. Определяется протокол лежащего выше уровня, которому адресован фрагмент.
</li>
<li>
Главный номер версии. Длина 8 бит. Главный номер версии используемого протокола SSL.
</li>
<li>
Дополнительное поле. Длина 8 бит.
</li>
<li>
Дополнительный номер протокола.
</li>
<li>
Длина сжатого фрагмента. Длина 16 бит. Длина в байтах фрагмента открытого текста. Максимальное значение 2<sup>14</sup> + 2048.
</li>
</ol>


<p>
<i>Протокол изменения параметров шифрования</i>. Этот протокол расположен над протоколом записи. Этот протокол служит для передачи сообщения с параметром скопировать состояние ожидания в текущее состояние в результате чего обновляются параметры шифров, используемых для данного соединения. Сообщение представляет собой 00000001.
</p>
<p>
<i>Протокол извещения</i>. Он предназначен для обмена служебными сообщениями о работе SSL. Он также расположен над протоколом записи. Сообщение состоит из 2 байт. Первый байт означает уровень предупреждения или уровень неустранимой ошибки. Если уровень равен 2, то соединение по протоколу SSL разрывается. Второй байт &mdash; код, означающий смысл извещения.
</p>
<p>
<i>Протокол квитирования</i>. Лежит над протоколом записи. По этому протоколу происходит взаимная аутентификация сторон, согласовываются алгоритмы шифрования и их параметры, алгоритмы вычисления кода аутентичности, передаются ключи. Этот протокол используется до начала передачи данных. Сообщение протокола состоит из 3 частей:
</p><ol>
<li>
Тип сообщения. Размер 1 байт.
</li>
<li>
Длина сообщения. Размер 3 байта.
</li>
<li>
Содержимое.
</li>
</ol>



</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> Работа протокола SSL </h3>
<div class="outline-text-3" id="text-7_1">

<p><i>Определение характеристик защиты</i>. Процесс передачи инициируется клиентом. Для этого он отправляет серверу сообщение "clien hello". В качестве параметров этого сообщения указываются наивысший номер версии протокола, поддерживаемый клиентом; случайное число &mdash; используется во время обмена ключами для защиты от атак воспроизведения; идентификатор сеанса &mdash; сеанс в протоколе ssl это связь между клиентом и сервером; список шифров, которые поддерживает клиент; список методов сжатия, которые поддерживает клиент. В ответ на это сообщение сервер должен послать сообщение "server hello", в котором будут те же параметры. В качестве случайного числа передаётся число, сгенерированное сервером.
</p>
<p>
Возможные методы обмена ключами &mdash; RSA, Диффи-Хелмана и его различные модификации.
</p>
<p>
Алгоритмы шифрование RC4, RC2, DES, IDEA, 3DES, DES40.
</p>
<p>
Вычисление кода проверки целостности MD5, SHA-1.
</p>
<p>
<i>Аутентификация и обмен ключами</i>. Если требуется аутентификация сервера, сервер отправляет свой сертификат X.509. Затем передаётся необходимая информация для выработки общего сеансового ключа с клиентом. В конце этой информации сервер отправляем "server done". Получив это сообщение клиент проверяет подлинность сертификата. После клиент отправляет свой сертификат серверу и необходимую со своей стороны информацию для выработки общего сеансового ключа.
</p>
<p>
<i>Завершение создания защищённого соединения</i>. Клиент отправляет сообщение изменение параметров шифрования, т. е. начинает работать протокол изменения параметров шифрования.
</p>
<p>
Затем сразу же отправляется сообщение "finished", которое зашифровано на выбранном алгоритмом с сформированным сеансовым ключом. В ответ на эти два сообщения сервер посылает своё сообщение изменение параметров шифрования и своё сообщение "finished", зашифрованное при помощи ключа. Эти сообщения нужны для того, чтобы узнать, что у клиента и сервера один сеансовый ключ.
</p>
<p>
Если установление сеанса завершилось успешно, начинается передачи данных от протоколов вышележащих уровней.
</p>
</div>

</div>
