other/IBST_Lectures.tex
\section{Протокол SSL}
\label{sec-7}


Протокол SSL предназначен для защищённой передачи данных через протокол TCP. Протокол SSL в стеке протоколов находится над TCP, но ниже протоколов прикладного уровня.

Протокол прикладного уровня, который используют SSL --- HTTP.

SSL состоит из 4 отдельных протоколов:
\emph{Протокол записи}. Этот протокол непосредственно взаимодействует с протоколом TCP. Он обеспечивает конфиденциальность сообщений и целостность сообщений. Конфиденциальность обеспечивается за счёт шифрования данных, а целостность сообщений за счёт добавления к данным кода аутентичности (контрольная сумма). Данные приложения разбиваются на фрагменты размером не более 2$^{\mathrm{14}}$ байт. Потом может быть выполнено сжатие данных. На эти данные вычисляется код аутентичности и этот код добавляется после данных.

Сформированный блок шифруется с использованием симметричного алгоритма. К полученному зашифрованному блоку добавляется заголовок протокола записи.
Сформированный пакет поступает на уровень протокола TCP.

Алгоритмы шифрования DES. Код аутентичности SHA-1.

Поля заголовка:
\begin{enumerate}
\item Тип содержимого. Длина 8 бит. Определяется протокол лежащего выше уровня, которому адресован фрагмент.
\item Главный номер версии. Длина 8 бит. Главный номер версии используемого протокола SSL.
\item Дополнительное поле. Длина 8 бит.
\item Дополнительный номер протокола.
\item Длина сжатого фрагмента. Длина 16 бит. Длина в байтах фрагмента открытого текста. Максимальное значение 2$^{\mathrm{14}}$ + 2048.
\end{enumerate}

\emph{Протокол изменения параметров шифрования}. Этот протокол расположен над протоколом записи. Этот протокол служит для передачи сообщения с параметром скопировать состояние ожидания в текущее состояние в результате чего обновляются параметры шифров, используемых для данного соединения. Сообщение представляет собой 00000001.

\emph{Протокол извещения}. Он предназначен для обмена служебными сообщениями о работе SSL. Он также расположен над протоколом записи. Сообщение состоит из 2 байт. Первый байт означает уровень предупреждения или уровень неустранимой ошибки. Если уровень равен 2, то соединение по протоколу SSL разрывается. Второй байт --- код, означающий смысл извещения.

\emph{Протокол квитирования}. Лежит над протоколом записи. По этому протоколу происходит взаимная аутентификация сторон, согласовываются алгоритмы шифрования и их параметры, алгоритмы вычисления кода аутентичности, передаются ключи. Этот протокол используется до начала передачи данных. Сообщение протокола состоит из 3 частей:
\begin{enumerate}
\item Тип сообщения. Размер 1 байт.
\item Длина сообщения. Размер 3 байта.
\item Содержимое.
\end{enumerate}
\subsection{Работа протокола SSL}
\label{sec-7_1}

\emph{Определение характеристик защиты}. Процесс передачи инициируется клиентом. Для этого он отправляет серверу сообщение ``clien hello''. В качестве параметров этого сообщения указываются наивысший номер версии протокола, поддерживаемый клиентом; случайное число --- используется во время обмена ключами для защиты от атак воспроизведения; идентификатор сеанса --- сеанс в протоколе ssl это связь между клиентом и сервером; список шифров, которые поддерживает клиент; список методов сжатия, которые поддерживает клиент. В ответ на это сообщение сервер должен послать сообщение ``server hello'', в котором будут те же параметры. В качестве случайного числа передаётся число, сгенерированное сервером.

Возможные методы обмена ключами --- RSA, Диффи-Хелмана и его различные модификации.

Алгоритмы шифрование RC4, RC2, DES, IDEA, 3DES, DES40.

Вычисление кода проверки целостности MD5, SHA-1.

\emph{Аутентификация и обмен ключами}. Если требуется аутентификация сервера, сервер отправляет свой сертификат X.509. Затем передаётся необходимая информация для выработки общего сеансового ключа с клиентом. В конце этой информации сервер отправляем ``server done''. Получив это сообщение клиент проверяет подлинность сертификата. После клиент отправляет свой сертификат серверу и необходимую со своей стороны информацию для выработки общего сеансового ключа.

\emph{Завершение создания защищённого соединения}. Клиент отправляет сообщение изменение параметров шифрования, т. е. начинает работать протокол изменения параметров шифрования.

Затем сразу же отправляется сообщение ``finished'', которое зашифровано на выбранном алгоритмом с сформированным сеансовым ключом. В ответ на эти два сообщения сервер посылает своё сообщение изменение параметров шифрования и своё сообщение ``finished'', зашифрованное при помощи ключа. Эти сообщения нужны для того, чтобы узнать, что у клиента и сервера один сеансовый ключ.

Если установление сеанса завершилось успешно, начинается передачи данных от протоколов вышележащих уровней.
