IBST_Lectures.org
** Уязвимости SSL

1. Вскрытие используемых алгоритмов шифрования.
2. Уязвимость к атакам открытого текста. Эта атака используется для определения сеансового ключа. Она может успешна из-за того в открытом тексте часто встречаются одни и те же команды протокола HTTP.
3. Атака воспроизведения. Противник пытается передать серверу заранее перехваченное сообщение от клиента. Успешность данной атаки определяется длиной случайного числа, являющегося идентификатором сеанса.
4. Атака "посредник". Противник между клиентом и сервером.

* Протокол Kerberos

Этот протокол предназначен для аутентификации и обмена ключами, которые нужны для установки защищённого канала связи между абонентами, работающими в Интернете.

Этот протокол является протоколом прикладного уровня и разработан для сетей TCP/IP.

Kerberos состоит:
1) Сервер аутентификации.
2) Сервер выдачи мандатов.
3) Клиенты.
4) Серверы, к которым пользователи (клиенты) обращаются за каким либо ресурсом.

Подстроен на основе протокола Нитхема/Шредера с 3-ей доверенной стороной. Первый 2 компонента являются этой стороной. 

На сервере аутентификации хранится БД, в которой записаны идентификаторы всех пользователей сети и их секретные ключи, идентификаторы всех ресурсов сети и их секретные ключи. Эти секретные ключи позволяют шифровать сообщения для клиентов и серверов. Успешное расшифрование этих сообщений является гарантией прохождения аутентификации всеми участниками протокола. 

