html/IBST_Lectures.html

<div id="outline-container-7_2" class="outline-3">
<h3 id="sec-7_2"><span class="section-number-3">7.2</span> Уязвимости SSL </h3>
<div class="outline-text-3" id="text-7_2">


<ol>
<li>
Вскрытие используемых алгоритмов шифрования.
</li>
<li>
Уязвимость к атакам открытого текста. Эта атака используется для определения сеансового ключа. Она может успешна из-за того в открытом тексте часто встречаются одни и те же команды протокола HTTP.
</li>
<li>
Атака воспроизведения. Противник пытается передать серверу заранее перехваченное сообщение от клиента. Успешность данной атаки определяется длиной случайного числа, являющегося идентификатором сеанса.
</li>
<li>
Атака "посредник". Противник между клиентом и сервером.
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Протокол Kerberos </h2>
<div class="outline-text-2" id="text-8">


<p>
Этот протокол предназначен для аутентификации и обмена ключами, которые нужны для установки защищённого канала связи между абонентами, работающими в Интернете.
</p>
<p>
Этот протокол является протоколом прикладного уровня и разработан для сетей TCP/IP.
</p>
<p>
Kerberos состоит:
</p><ol>
<li>
Сервер аутентификации.
</li>
<li>
Сервер выдачи мандатов.
</li>
<li>
Клиенты.
</li>
<li>
Серверы, к которым пользователи (клиенты) обращаются за каким либо ресурсом.
</li>
</ol>


<p>
Подстроен на основе протокола Нитхема/Шредера с 3-ей доверенной стороной. Первый 2 компонента являются этой стороной. 
</p>
<p>
На сервере аутентификации хранится БД, в которой записаны идентификаторы всех пользователей сети и их секретные ключи, идентификаторы всех ресурсов сети и их секретные ключи. Эти секретные ключи позволяют шифровать сообщения для клиентов и серверов. Успешное расшифрование этих сообщений является гарантией прохождения аутентификации всеми участниками протокола. 
</p>

</div>
