other/IBST_Lectures.tex
\subsection{Уязвимости SSL}
\label{sec-7_2}


\begin{enumerate}
\item Вскрытие используемых алгоритмов шифрования.
\item Уязвимость к атакам открытого текста. Эта атака используется для определения сеансового ключа. Она может успешна из-за того в открытом тексте часто встречаются одни и те же команды протокола HTTP.
\item Атака воспроизведения. Противник пытается передать серверу заранее перехваченное сообщение от клиента. Успешность данной атаки определяется длиной случайного числа, являющегося идентификатором сеанса.
\item Атака ``посредник''. Противник между клиентом и сервером.
\end{enumerate}
\section{Протокол Kerberos}
\label{sec-8}


Этот протокол предназначен для аутентификации и обмена ключами, которые нужны для установки защищённого канала связи между абонентами, работающими в Интернете.

Этот протокол является протоколом прикладного уровня и разработан для сетей TCP/IP.

Kerberos состоит:
\begin{enumerate}
\item Сервер аутентификации.
\item Сервер выдачи мандатов.
\item Клиенты.
\item Серверы, к которым пользователи (клиенты) обращаются за каким либо ресурсом.
\end{enumerate}

Подстроен на основе протокола Нитхема/Шредера с 3-ей доверенной стороной. Первый 2 компонента являются этой стороной. 

На сервере аутентификации хранится БД, в которой записаны идентификаторы всех пользователей сети и их секретные ключи, идентификаторы всех ресурсов сети и их секретные ключи. Эти секретные ключи позволяют шифровать сообщения для клиентов и серверов. Успешное расшифрование этих сообщений является гарантией прохождения аутентификации всеми участниками протокола. 
