IBST_Lectures.org
** Описание протокола

1) Клиент посылает серверу аутентификации сообщения с запросом на разрешение доступа к серверу выдачи мандатов. Это сообщение включает в себя:
   - идентификатор клиента, 
   - идентификатор сервера выдачи мандатов и 
   - метку времени.
2) Сервер аутентификации отвечает клиенту в сообщении, которое зашифровано секретным ключом клиента, который хранился в БД. В этом сообщении содержится:
      - сеансовый ключ для связи с сервером выдачи мандатов,
      - идентификатор сервера выдачи мандатов, 
      - метку времени, когда был отправлен ответ, срок действия мандата и мандат сервера выдачи мандата. /Мандат/ --- специальная информация, на основе которой происходит проверка подлинности обращающего субъекта.
3) Клиент посылает полученный мандат и идентификатор требуемого ему сервиса серверу выдачи мандатов. В этом сообщении присутствует /аутентификатор клиента/. Аутентификатор клиента из идентификатора клиента, сетевого адреса и метки времени. Эти 3 компонента зашифровываются на ключе, который был получен на шаге 2.
4) Сервер выдачи мандатов расшифровывает полученный аутентификатор клиента, проверяет разрешён ли клиенту доступ к запрашиваемому ресурсу и если разрешён, посылает сообщение, зашифрованное тем же ключом, полученным в шаге 2. Сообщение состоит из:
   - ключа для установления связи между клиентом и запрашиваемым сервисом,
   - идентификатора сервиса, 
   - метки времени и мандата сервиса. /Мандат сервиса/ --- зашифрованное сообщение при помощи ключа связи между сервисом и сервером выдачи мандатов. Внутри этого сообщения находится:
     * сеансовый ключ для связи клиента и сервиса,
     * идентификатор клиента,
     * сетевой адрес клиента,
     * идентификатор сервиса,
     * метка времени,
     * срок действия мандата.
5) Клиент передаёт сервису полученный на шаге 4 мандат и свой аутентификатор. Аутентификатор на этом шаге шифруется при помощи ключа, полученного на шаге 4.
6) Сервис проверяет полученное сообщение. Если процедуры расшифрования прошли успешно, то аутентификация прошла успешно, т. е. сервис удостоверился, что к нему обращается клиент, указанный в сообщении. Происходит, если требуется аутентификация сервиса. Сервис отсылает клиенту зашифрованное сообщение, полученную на шаге 5 метку времени + 1-ца. Используется ключ тот же, что и на шаге 5 для шифрования аутентификатора.

Среда Kerberos должна удовлетворять следующим условиям:
1) Сервер аутентификации должен хранить свои байты данных, хешированные пароли всех пользователей системы. Пароли пользователей используются для формирования идентификатора клиента.
2) Все сервисы в сети должны быть зарегистрированы и у каждого из них должен быть свой секретный ключ для связи с сервером Kerberos.

Kerberos работает в пределах одной локальной сети. Если пользователю требуются ресурсы другой сети, то Kerberos доступа к ним не разрешит. Чтобы это устранить необходимо, чтобы оба сервера Kerberos были зарегистрированы друг в друге. Соответственно для связи между серверами должны быть установлены секретные ключи. При такой конфигурации клиент сначала в своей сети должен получить мандат доступа к серверу выдачи мандатов в другой сети. После этого клиент обращается к серверу выдачи мандатов другой сети и получает доступ к интересующему ресурсу.

Отличия 4 и 5 версии Kerberos: в версии 4 использовался алгоритм шифрования DES. В версии 5 может быть выбран любой другой алгоритм шифрования. В версии 4 требуется использование IP-адрасации, в версии 5 --- любые сетевые адреса. В версии 4 срок действия мандата составлял 1280 минут максимум, потому, что срок действия мандата представлялся 8-битовым числом; в версии 5 явно указывается момент начала действия мандата и момент его окончания.

Уязвимости Kerberos:
1) Повторное использование перехваченной информации.
2) Синхронизация часов. Т. е. система будет работать правильно, если у всех её участников часы синхронизированы.
3) Сложность паролей.
4) Повторное использование идентификаторов субъектов. Новый объект системы может получить идентификатор выбывшего. 
5) Сеансовые ключи. Один и тот же ключ используется в нескольких сеансах связи.

Kerberos в настоящее время поддерживается Windows и FreeBSD.

