html/IBST_Lectures.html

<div id="outline-container-8_1" class="outline-3">
<h3 id="sec-8_1"><span class="section-number-3">8.1</span> Описание протокола </h3>
<div class="outline-text-3" id="text-8_1">


<ol>
<li>
Клиент посылает серверу аутентификации сообщения с запросом на разрешение доступа к серверу выдачи мандатов. Это сообщение включает в себя:
<ul>
<li>
идентификатор клиента, 
</li>
<li>
идентификатор сервера выдачи мандатов и 
</li>
<li>
метку времени.
</li>
</ul>
</li>
<li>
Сервер аутентификации отвечает клиенту в сообщении, которое зашифровано секретным ключом клиента, который хранился в БД. В этом сообщении содержится:
<ul>
<li>
сеансовый ключ для связи с сервером выдачи мандатов,
</li>
<li>
идентификатор сервера выдачи мандатов, 
</li>
<li>
метку времени, когда был отправлен ответ, срок действия мандата и мандат сервера выдачи мандата. <i>Мандат</i> &mdash; специальная информация, на основе которой происходит проверка подлинности обращающего субъекта.
</li>
</ul>
</li>
<li>
Клиент посылает полученный мандат и идентификатор требуемого ему сервиса серверу выдачи мандатов. В этом сообщении присутствует <i>аутентификатор клиента</i>. Аутентификатор клиента из идентификатора клиента, сетевого адреса и метки времени. Эти 3 компонента зашифровываются на ключе, который был получен на шаге 2.
</li>
<li>
Сервер выдачи мандатов расшифровывает полученный аутентификатор клиента, проверяет разрешён ли клиенту доступ к запрашиваемому ресурсу и если разрешён, посылает сообщение, зашифрованное тем же ключом, полученным в шаге 2. Сообщение состоит из:
<ul>
<li>
ключа для установления связи между клиентом и запрашиваемым сервисом,
</li>
<li>
идентификатора сервиса, 
</li>
<li>
метки времени и мандата сервиса. <i>Мандат сервиса</i> &mdash; зашифрованное сообщение при помощи ключа связи между сервисом и сервером выдачи мандатов. Внутри этого сообщения находится:
<ul>
<li>
сеансовый ключ для связи клиента и сервиса,
</li>
<li>
идентификатор клиента,
</li>
<li>
сетевой адрес клиента,
</li>
<li>
идентификатор сервиса,
</li>
<li>
метка времени,
</li>
<li>
срок действия мандата.
</li>
</ul>
</li>
</ul>
</li>
<li>
Клиент передаёт сервису полученный на шаге 4 мандат и свой аутентификатор. Аутентификатор на этом шаге шифруется при помощи ключа, полученного на шаге 4.
</li>
<li>
Сервис проверяет полученное сообщение. Если процедуры расшифрования прошли успешно, то аутентификация прошла успешно, т. е. сервис удостоверился, что к нему обращается клиент, указанный в сообщении. Происходит, если требуется аутентификация сервиса. Сервис отсылает клиенту зашифрованное сообщение, полученную на шаге 5 метку времени + 1-ца. Используется ключ тот же, что и на шаге 5 для шифрования аутентификатора.
</li>
</ol>


<p>
Среда Kerberos должна удовлетворять следующим условиям:
</p><ol>
<li>
Сервер аутентификации должен хранить свои байты данных, хешированные пароли всех пользователей системы. Пароли пользователей используются для формирования идентификатора клиента.
</li>
<li>
Все сервисы в сети должны быть зарегистрированы и у каждого из них должен быть свой секретный ключ для связи с сервером Kerberos.
</li>
</ol>


<p>
Kerberos работает в пределах одной локальной сети. Если пользователю требуются ресурсы другой сети, то Kerberos доступа к ним не разрешит. Чтобы это устранить необходимо, чтобы оба сервера Kerberos были зарегистрированы друг в друге. Соответственно для связи между серверами должны быть установлены секретные ключи. При такой конфигурации клиент сначала в своей сети должен получить мандат доступа к серверу выдачи мандатов в другой сети. После этого клиент обращается к серверу выдачи мандатов другой сети и получает доступ к интересующему ресурсу.
</p>
<p>
Отличия 4 и 5 версии Kerberos: в версии 4 использовался алгоритм шифрования DES. В версии 5 может быть выбран любой другой алгоритм шифрования. В версии 4 требуется использование IP-адрасации, в версии 5 &mdash; любые сетевые адреса. В версии 4 срок действия мандата составлял 1280 минут максимум, потому, что срок действия мандата представлялся 8-битовым числом; в версии 5 явно указывается момент начала действия мандата и момент его окончания.
</p>
<p>
Уязвимости Kerberos:
</p><ol>
<li>
Повторное использование перехваченной информации.
</li>
<li>
Синхронизация часов. Т. е. система будет работать правильно, если у всех её участников часы синхронизированы.
</li>
<li>
Сложность паролей.
</li>
<li>
Повторное использование идентификаторов субъектов. Новый объект системы может получить идентификатор выбывшего. 
</li>
<li>
Сеансовые ключи. Один и тот же ключ используется в нескольких сеансах связи.
</li>
</ol>


<p>
Kerberos в настоящее время поддерживается Windows и FreeBSD.
</p>
</div>
</div>

</div>
