other/IBST_Lectures.tex
\subsection{Описание протокола}
\label{sec-8_1}


\begin{enumerate}
\item Клиент посылает серверу аутентификации сообщения с запросом на разрешение доступа к серверу выдачи мандатов. Это сообщение включает в себя:

\begin{itemize}
\item идентификатор клиента,
\item идентификатор сервера выдачи мандатов и
\item метку времени.
\end{itemize}

\item Сервер аутентификации отвечает клиенту в сообщении, которое зашифровано секретным ключом клиента, который хранился в БД. В этом сообщении содержится:

\begin{itemize}
\item сеансовый ключ для связи с сервером выдачи мандатов,
\item идентификатор сервера выдачи мандатов,
\item метку времени, когда был отправлен ответ, срок действия мандата и мандат сервера выдачи мандата. \emph{Мандат} --- специальная информация, на основе которой происходит проверка подлинности обращающего субъекта.
\end{itemize}

\item Клиент посылает полученный мандат и идентификатор требуемого ему сервиса серверу выдачи мандатов. В этом сообщении присутствует \emph{аутентификатор клиента}. Аутентификатор клиента из идентификатора клиента, сетевого адреса и метки времени. Эти 3 компонента зашифровываются на ключе, который был получен на шаге 2.
\item Сервер выдачи мандатов расшифровывает полученный аутентификатор клиента, проверяет разрешён ли клиенту доступ к запрашиваемому ресурсу и если разрешён, посылает сообщение, зашифрованное тем же ключом, полученным в шаге 2. Сообщение состоит из:

\begin{itemize}
\item ключа для установления связи между клиентом и запрашиваемым сервисом,
\item идентификатора сервиса,
\item метки времени и мандата сервиса. \emph{Мандат сервиса} --- зашифрованное сообщение при помощи ключа связи между сервисом и сервером выдачи мандатов. Внутри этого сообщения находится:

\begin{itemize}
\item сеансовый ключ для связи клиента и сервиса,
\item идентификатор клиента,
\item сетевой адрес клиента,
\item идентификатор сервиса,
\item метка времени,
\item срок действия мандата.
\end{itemize}

\end{itemize}

\item Клиент передаёт сервису полученный на шаге 4 мандат и свой аутентификатор. Аутентификатор на этом шаге шифруется при помощи ключа, полученного на шаге 4.
\item Сервис проверяет полученное сообщение. Если процедуры расшифрования прошли успешно, то аутентификация прошла успешно, т. е. сервис удостоверился, что к нему обращается клиент, указанный в сообщении. Происходит, если требуется аутентификация сервиса. Сервис отсылает клиенту зашифрованное сообщение, полученную на шаге 5 метку времени + 1-ца. Используется ключ тот же, что и на шаге 5 для шифрования аутентификатора.
\end{enumerate}

Среда Kerberos должна удовлетворять следующим условиям:
\begin{enumerate}
\item Сервер аутентификации должен хранить свои байты данных, хешированные пароли всех пользователей системы. Пароли пользователей используются для формирования идентификатора клиента.
\item Все сервисы в сети должны быть зарегистрированы и у каждого из них должен быть свой секретный ключ для связи с сервером Kerberos.
\end{enumerate}

Kerberos работает в пределах одной локальной сети. Если пользователю требуются ресурсы другой сети, то Kerberos доступа к ним не разрешит. Чтобы это устранить необходимо, чтобы оба сервера Kerberos были зарегистрированы друг в друге. Соответственно для связи между серверами должны быть установлены секретные ключи. При такой конфигурации клиент сначала в своей сети должен получить мандат доступа к серверу выдачи мандатов в другой сети. После этого клиент обращается к серверу выдачи мандатов другой сети и получает доступ к интересующему ресурсу.

Отличия 4 и 5 версии Kerberos: в версии 4 использовался алгоритм шифрования DES. В версии 5 может быть выбран любой другой алгоритм шифрования. В версии 4 требуется использование IP-адрасации, в версии 5 --- любые сетевые адреса. В версии 4 срок действия мандата составлял 1280 минут максимум, потому, что срок действия мандата представлялся 8-битовым числом; в версии 5 явно указывается момент начала действия мандата и момент его окончания.

Уязвимости Kerberos:
\begin{enumerate}
\item Повторное использование перехваченной информации.
\item Синхронизация часов. Т. е. система будет работать правильно, если у всех её участников часы синхронизированы.
\item Сложность паролей.
\item Повторное использование идентификаторов субъектов. Новый объект системы может получить идентификатор выбывшего.
\item Сеансовые ключи. Один и тот же ключ используется в нескольких сеансах связи.
\end{enumerate}

Kerberos в настоящее время поддерживается Windows и FreeBSD.
