html/IBST_Lectures.html

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Межсетевые экраны </h2>
<div class="outline-text-2" id="text-9">


<p>
Межсетевые экраны реализуют методы контроля за информацией, поступающей или выходящей из системы.
</p>
<p>
Защита системы обеспечивается за счёт фильтрации информации на основе критериев, заданных администратором.
</p>
<p>
Процедура фильтрации включает в себя анализ заголовков каждого пакета, проходящего через экран и передача их дальше только в том случае, если они удовлетворяют правилам фильтрации. Если не удовлетворяет, то пакет уничтожается. 
</p>
<p>
Фильтрация пакетов может выполняться для протоколов разных иерархических уровней (сетевого, транспортного, прикладного).
</p>
<ol>
<li>
На сетевом уровне в качестве критериев фильтрации используются IP-адреса отправителя и получателя, тип данных в пакете ICMP протокола и т. п.
</li>
<li>
На транспортном уровне &mdash; номера портов отправителя, получателя, флаги в TCP-сегментах, поле <i>длина</i> в TCP сегменте.
</li>
<li>
На прикладном уровне &mdash; типы команд протокола, длины заголовков, адреса ресурсов.
</li>
</ol>


<p>
Правила фильтрации могут быть настроены 2 способами:
</p><ol>
<li>
Всё, что не запрещено &mdash; разрешено.
</li>
<li>
Всё, что не разрешено &mdash; запрещено.
</li>
</ol>


<p>
Межсетевые экраны позволяют скрывать реальные IP адреса в защищаемой системе при помощи функции трансляции сетевых адресов (NAT).
</p>
<p>
При поступлении пакета данных межсетевой экран заменяет реальный IP адрес отправителя пакета на виртуальный и посылает его получателю. 
</p>
<ol>
<li>
Виртуальный IP адрес может быть неизменным, т. е. одинаковый для всех адресатов. В этом случае межсетевой экран каждому соединению присваивает уникальное числовое значение (номера портов).
</li>
<li>
Для каждого узла защищаемой сети может быть выделен отдельный виртуальный адрес. При этом эти адреса периодически изменяются.
</li>
</ol>


<p>
Межсетевые экраны могут реализованы аппаратно или программно. Аппаратные экраны обычно устанавливаются в точке подключения защищаемой сети к Интернету. Программные реализации экранов устанавливаются на серверы, рабочие станции, некоторые типы маршрутизаторов и коммутаторов.
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Максим Захаров
</p>
<p class="date"> Date: 2011-01-04 11:57:01 MSK</p>
<p class="creator">HTML generated by org-mode 7.5 in emacs 23</p>
</div>
</div>
</body>
</html>
