other/IBST_Lectures.tex
\section{Межсетевые экраны}
\label{sec-9}


Межсетевые экраны реализуют методы контроля за информацией, поступающей или выходящей из системы.

Защита системы обеспечивается за счёт фильтрации информации на основе критериев, заданных администратором.

Процедура фильтрации включает в себя анализ заголовков каждого пакета, проходящего через экран и передача их дальше только в том случае, если они удовлетворяют правилам фильтрации. Если не удовлетворяет, то пакет уничтожается. 

Фильтрация пакетов может выполняться для протоколов разных иерархических уровней (сетевого, транспортного, прикладного).

\begin{enumerate}
\item На сетевом уровне в качестве критериев фильтрации используются IP-адреса отправителя и получателя, тип данных в пакете ICMP протокола и т. п.
\item На транспортном уровне --- номера портов отправителя, получателя, флаги в TCP-сегментах, поле \emph{длина} в TCP сегменте.
\item На прикладном уровне --- типы команд протокола, длины заголовков, адреса ресурсов.
\end{enumerate}

Правила фильтрации могут быть настроены 2 способами:
\begin{enumerate}
\item Всё, что не запрещено --- разрешено.
\item Всё, что не разрешено --- запрещено.
\end{enumerate}

Межсетевые экраны позволяют скрывать реальные IP адреса в защищаемой системе при помощи функции трансляции сетевых адресов (NAT).

При поступлении пакета данных межсетевой экран заменяет реальный IP адрес отправителя пакета на виртуальный и посылает его получателю. 

\begin{enumerate}
\item Виртуальный IP адрес может быть неизменным, т. е. одинаковый для всех адресатов. В этом случае межсетевой экран каждому соединению присваивает уникальное числовое значение (номера портов).
\item Для каждого узла защищаемой сети может быть выделен отдельный виртуальный адрес. При этом эти адреса периодически изменяются.
\end{enumerate}

Межсетевые экраны могут реализованы аппаратно или программно. Аппаратные экраны обычно устанавливаются в точке подключения защищаемой сети к Интернету. Программные реализации экранов устанавливаются на серверы, рабочие станции, некоторые типы маршрутизаторов и коммутаторов.

\end{document}
